[
  {
    "course_prefix": "ACC",
    "course_number": "124",
    "course_title": "Principles of Accounting I",
    "course_desc": "This course introduces basic accounting principles and practices for service and/or merchandising types of businesses. Areas include accounting as an information system, the accounting cycle, financial statements, internal control, current and/or long-term assets, current liabilities, and payroll. Special emphasis will be placed upon the practical application of accounting principles.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ACC",
    "course_number": "125",
    "course_title": "Principles of Accounting II",
    "course_desc": "This course continues the study of financial accounting procedures. Areas include: long-term assets, long-term liabilities, accounting for corporations and/or partnerships. The statement of cash flows and financial statement analysis may be covered.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in ACC 124."
  },
  {
    "course_prefix": "ACC",
    "course_number": "126",
    "course_title": "Principles of Accounting III",
    "course_desc": "This course introduces basic accounting principles and practices for manufacturing businesses and introduces basic principles and practices of managerial accounting. Areas include financial statement analysis, cost accounting, budgeting, standard cost systems, break-even analysis, responsibility accounting, and capital budgeting.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: “C” or higher in ACC 125."
  },
  {
    "course_prefix": "ACC",
    "course_number": "132",
    "course_title": "Payroll and Hawai‘i General Excise Tax",
    "course_desc": "This course introduces principles, manual and computerized procedures, and terminology for business applications of payroll accounting. Areas include preparation of federal and Hawai‘i state forms for payroll taxes and the Hawai‘i General Excise and Use Tax.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher or concurrent enrollment in ACC 124 or ACC 201."
  },
  {
    "course_prefix": "ACC",
    "course_number": "134",
    "course_title": "Individual Income Tax Preparation",
    "course_desc": "This course introduces the preparation of federal and state of Hawai‘i individual income tax returns with an emphasis on tax law and regulations and their application to the tax returns. This course is intended for an individual preparing basic tax returns under the supervision of an accounting professional.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: “C” or higher or concurrent enrollment in either ACC 124 or ACC 201."
  },
  {
    "course_prefix": "ACC",
    "course_number": "137",
    "course_title": "Business Income Tax Preparation",
    "course_desc": "This course introduces Federal and Hawai‘i tax laws and regulations and basic return preparation for business entities. This course is intended for an individual preparing basic tax returns under the supervision of an accounting professional.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in ACC 134."
  },
  {
    "course_prefix": "ACC",
    "course_number": "193",
    "course_title": "Cooperative Education",
    "course_desc": "Cooperative Education provides practical career-related work experience through a program used nationally in colleges and universities to apply classroom knowledge and to develop job competencies. Full-time or part-time work (with or without compensation) in private and public sectors is utilized for this program. The number of credits earned depends upon the number of hours spent at the job station during the semester.",
    "num_units": "1",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 hour per week with coordinator and 75 hours work experience for each credit.; Semester Offered: Spring, Summer; Prerequisites: Approval of instructor.; Comments: This course is intended for Accounting majors. Additional prerequisites may be required by different campuses."
  },
  {
    "course_prefix": "ACC",
    "course_number": "201",
    "course_title": "Introduction to Financial Accounting",
    "course_desc": "This course is an introduction to accounting principles and practices used to record and communicate financial information and to analyze methods for valuating assets, liabilities, and equity of an organization.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ACC",
    "course_number": "202",
    "course_title": "Introduction to Managerial Accounting",
    "course_desc": "This course is an introduction to managerial accounting methods for evaluating performance including cost accounting, budgeting, break-even analysis, ratio analysis, standard cost systems, and reporting for internal decision making. Also included are principles and procedures relating to cash flow analysis and corporations.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in ACC 201 or \"C\" or higher in both ACC 124 and ACC 125."
  },
  {
    "course_prefix": "ACC",
    "course_number": "252",
    "course_title": "Using Quickbooks in Accounting",
    "course_desc": "This course provides a \"hands-on\" approach to computerized accounting using QuickBooks. Students will apply previously acquired accounting skills and knowledge in a computerized environment to set up and maintain accounting records. An emphasis will be placed on the application of QuickBooks to the accounting cycle.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in either ACC 124 or ACC 201 or approval of instructor."
  },
  {
    "course_prefix": "ACC",
    "course_number": "255",
    "course_title": "Using Excel® in Accounting",
    "course_desc": "This course provides hands-on training in the use of spreadsheets on computers to solve accounting problems. It applies previously acquired accounting skills and knowledge and emphasizes financial and managerial accounting. Additionally, students will develop the ability to use a numeric keypad to perform business computations.",
    "num_units": "3",
    "dept_name": "Accounting (ACC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in either ACC 124 or ACC 201; or approval of instructor."
  },
  {
    "course_prefix": "AEC",
    "course_number": "99",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "3",
    "dept_name": "Architectural, Engineering, and CAD Technologies (AEC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: “C” or higher or concurrent enrollment in AEC 101."
  },
  {
    "course_prefix": "AEC",
    "course_number": "101",
    "course_title": "Construction Graphics and Conventions",
    "course_desc": "This course covers an introduction to the principles of graphic communication and conventions as it applies to drawing and reading construction plans using hand sketching, various computer-aided design, and construction administration software. Techniques for measuring items of construction work from plans and specifications, layout, terminology, graphic standards and drafting fundamentals are studied. There is an emphasis on how to locate information and cross reference with details, schedules, and specifications for clarification. This course also introduces students to some computer architectural 3D modeling using SketchUp or similar software.",
    "num_units": "3",
    "dept_name": "Architectural, Engineering, and CAD Technologies (AEC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "AEC",
    "course_number": "110",
    "course_title": "Basic AutoCAD",
    "course_desc": "This course introduces the foundations of AutoCAD. Included are the basic commands and operations from 2D drawing and editing tools to the creation of solid models and renderings. Students study 2D drawing, text, dimensions, blocks, hatching, reference files, sharing data, 3D drawing, and plotting capabilities. Students are provided additional concepts and tools that demonstrate technical knowledge essential to the architectural, engineering, and construction technology related fields.",
    "num_units": "4",
    "dept_name": "Architectural, Engineering, and CAD Technologies (AEC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Spring; Prerequisites: “C” or higher or concurrent enrollment in AEC 101."
  },
  {
    "course_prefix": "AEC",
    "course_number": "161",
    "course_title": "Building Information Modeling Software",
    "course_desc": "This course provides students with the opportunity to work on a medium-size modeling/drafting project using the latest architectural software. Emphasis is on the three-dimensional drawing. Architectural models, rendering, and animation are important elements of the course. Students create photo realistic computer images of buildings, components, and the project site.",
    "num_units": "3",
    "dept_name": "Architectural, Engineering, and CAD Technologies (AEC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in AEC 101."
  },
  {
    "course_prefix": "AEC",
    "course_number": "164",
    "course_title": "Residential Planning and Design",
    "course_desc": "This course addresses residential design fundamentals and design development. The application of AEC 101 and AEC 110 techniques contribute to preliminary board designs of increasing complexity. This course includes architectural design concepts, study models and principles, application of architectural software, rendering, and group and juried presentations.",
    "num_units": "3",
    "dept_name": "Architectural, Engineering, and CAD Technologies (AEC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in AEC 101. \"C\" or higher or concurrent enrollment in AEC 110."
  },
  {
    "course_prefix": "AG",
    "course_number": "102",
    "course_title": "Orientation to Hawai‘i Agriculture Industry",
    "course_desc": "This course familiarizes students with different agricultural operations/systems in Hawai‘i through lectures, research, student presentations, guest speakers and/or field trips.",
    "num_units": "1",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "AG",
    "course_number": "122",
    "course_title": "Soil Technology",
    "course_desc": "This course (i) studies identification, preparation, and fertilization of soils, (ii) discusses soil formation, soil classification, soil reaction, soil and water relationships, soil protection and irrigation practices, and (iii) emphasizes sustainable management systems.",
    "num_units": "3",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 3 lab; Semester Offered: Spring"
  },
  {
    "course_prefix": "AG",
    "course_number": "141",
    "course_title": "Integrated Pest Management",
    "course_desc": "This course includes an introduction to the principles involved in the control of plant pests including diseases, insects, mites, nematodes, and weeds. Various methods of controlling pests, including the correct method of selecting and applying pesticides will be covered. Integrated pest management will be incorporated into the course.",
    "num_units": "3",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "AG",
    "course_number": "200",
    "course_title": "Principles of Horticulture",
    "course_desc": "This course introduces plant anatomy and physiology, as well as discusses plant nutrients, moisture, environmental requirements, and plant propagation. In addition, culture and production techniques for selected ornamental crops will be studied.",
    "num_units": "3",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in AG 200L."
  },
  {
    "course_prefix": "AG",
    "course_number": "264",
    "course_title": "Plant Propagation",
    "course_desc": "This is an introductory course in the principles and practices of plant propagation. This course will focus on: (i) theoretical and applied aspects of sexual and asexual reproduction of plants and (ii) propagation of selected plants by seed, cuttings, grafting, layering, and micropropagation/tissue culture.",
    "num_units": "3",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "AG",
    "course_number": "271",
    "course_title": "Introduction to Crop Improvement",
    "course_desc": "This course includes fundamentals of genetic theory using biotechnological procedures in insect and plant pathogen control and plant and animal breeding as practical applications.",
    "num_units": "3",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 3 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in AG 200, BOT 101, or both SCI 121 and SCI 121L."
  },
  {
    "course_prefix": "AG",
    "course_number": "293",
    "course_title": "Plant Biology and Tropical Agriculture Internship",
    "course_desc": "The course provides credit for supervised experiential learning projects including independent research projects with an instructor and internships with an employer. The nature of the internship or research project is variable but will be designed to provide an opportunity for experiential learning. Students may enroll in 1-3 credits of AG 293V per semester, depending on project time commitment.",
    "num_units": "1",
    "dept_name": "Agriculture (AG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 hour per week with coordinator and 75 hours work experience for each credit.; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated for a maximum of 12 credits."
  },
  {
    "course_prefix": "AMT",
    "course_number": "16",
    "course_title": "Car Care",
    "course_desc": "This course offers technical information on the history and development of automobiles; the function of the lubricating, cooling, fuel, and electrical systems; the major automobile components; minor troubleshooting; tire changing; and car maintenance.",
    "num_units": "1",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture/lab; Semester Offered: Fall"
  },
  {
    "course_prefix": "AMT",
    "course_number": "18",
    "course_title": "Minor Tune-up and Repair",
    "course_desc": "This course is designed to help students acquire an understanding of some of the elementary principles involved in the operation and maintenance of the various units of an automobile. Emphasis is upon developing the student's interest in minor automotive repair in a safe and efficient manner.",
    "num_units": "2",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture/lab; Semester Offered: Fall"
  },
  {
    "course_prefix": "AMT",
    "course_number": "100",
    "course_title": "Introduction to Automotive Technology",
    "course_desc": "This course will cover policies and procedures of the Automotive Technology (AMT) program, various career opportunities in the automotive field, shop safety, proper use of technical reference manuals and identifying and proper use of basic hand tools and precision measuring tools.",
    "num_units": "2",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture/lab; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "AMT",
    "course_number": "120",
    "course_title": "Auto Metal Work and Welding",
    "course_desc": "This course is designed to acquaint the student with the basic skills used in auto body welding. Emphasis will be placed on safety; protective clothing; tools and equipment procedures; and techniques of gas metal arc welding (GMAW), oxyacetylene gas welding, and plasma arc cutting.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "AMT",
    "course_number": "126",
    "course_title": "Non-Structural Analysis and Repair I",
    "course_desc": "This course is designed to teach the student conventional and unitized body construction. Emphasis will be placed on what can be repaired and what must be replaced. Students will learn to lay out and fabricate repair panels from gauge sheet metal and repair rust damage.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "AMT",
    "course_number": "129",
    "course_title": "Engine Repair",
    "course_desc": "This course will cover shop safety, tools and all components found in the modern internal combustion engine. The course is designed to provide students with an understanding of the fundamental operation and construction of internal combustion engines. Instruction will include theory and laboratory (shop) activities in which students will learn how to inspect, service, maintain, diagnose, and repair automobile engine malfunctions. This course includes live work.",
    "num_units": "7",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 14 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "134",
    "course_title": "Paint Prep and Refinishing I",
    "course_desc": "This course is designed to teach students the techniques and methods of automobile surface painting preparation and introductory painting procedures. The course incorporates an emphasis on proper safety procedures and practises for automotive refinishing, which includes OSHA guidelines, Right-to-Know Act, and EPA laws.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall"
  },
  {
    "course_prefix": "AMT",
    "course_number": "136",
    "course_title": "Non-Structural Analysis and Repair II",
    "course_desc": "This course is designed to teach the student conventional and unitized body repair. Emphasis will be placed on outer body panel repairs, replacements and adjustments to manufacturer's specifications.",
    "num_units": "6",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 12 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in AMT 126B."
  },
  {
    "course_prefix": "AMT",
    "course_number": "141",
    "course_title": "Electrical/Electronic Systems I",
    "course_desc": "This course will provide students with fundamental principles of automotive electricity and electronics. Practical skills to diagnose, test, and service battery, starting, charging and lighting systems are covered. Testing and repair of electrical safety devices, wiring, connectors, and relays are also covered.",
    "num_units": "5",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 10 lecture/lab; Semester Offered: Fall; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "144",
    "course_title": "Heating and Air Conditioning",
    "course_desc": "This course provides an understanding of the theory, diagnosis, service, safety handling of refrigerant and repair of automotive heating, ventilation, and air conditioning (HVAC) systems. The course presents the operation and function of vacuum, electrical, refrigeration circuits, and computer controls. Training is provided on the use of tools and equipment while performing diagnostics, repairs, and service on HVAC systems.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "145",
    "course_title": "Manual Drive Trains and Axles",
    "course_desc": "This course covers the theory and fundamental operating principles of the modern automotive drive trains and axles. Students learn maintenance and repair of C-V shafts, propeller shafts, clutch systems, standard transmissions, standard transaxles, all-wheel drive, four-wheel drive and final drive systems.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "149",
    "course_title": "Automatic Transmission and Transaxle",
    "course_desc": "This course covers the fundamental principles of automatic transmission design and operation found on Front Wheel Drive (FWD) and Rear Wheel Drive (RWD) automobiles. Service, repair, and overhaul procedures are included for a variety of import and domestic automatic transmissions.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "152",
    "course_title": "Brake Systems",
    "course_desc": "This course covers the principles in the operation of the modern automotive brake system. Further development in new technology such as computerized ABS (Anti-skid Brake Systems), electronic power brakes, and four-wheel disc brakes will be covered. Repair and service techniques of the complete brake system will be demonstrated.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "154",
    "course_title": "Suspension and Steering Systems",
    "course_desc": "This course presents the theory and practical application of the operation, problem diagnosis, maintenance and repair of the modern suspension and steering systems to include: front wheel drive steering and suspension systems; rear wheel drive steering and suspension systems; four wheel drive steering and suspension systems; and all-wheel drive steering and suspension systems. Wheel alignment and tire servicing are also covered.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall; Prerequisites: “C” or higher in AMT 100."
  },
  {
    "course_prefix": "AMT",
    "course_number": "171",
    "course_title": "HEV I - Introduction to Hybrid and Electric Vehicle Technology",
    "course_desc": "This course is designed to familiarize the student with the safety, electrical and electronic theories related to hybrid and electric vehicles, high voltage analysis tools used in hybrid and electric vehicles, high voltage safety systems, AC induction electric machines, and permanent magnet electric motors theory and construction. Hands-on application to safety disconnect and use of high voltage analysis tools to perform basic checks.",
    "num_units": "3",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 6 lab; Semester Offered: Fall; Prerequisites: \"C\" or higher in AMT 141 or automotive industry work experience with instructor's approval."
  },
  {
    "course_prefix": "AMT",
    "course_number": "172",
    "course_title": "HEV II - Preventive Maintenance and Repair",
    "course_desc": "This course is designed to familiarize the student with hybrid and electric vehicle safety, hybrid internal combustion engines (ICE), regenerative braking systems, high voltage climate control system, power inverter and battery pack cooling systems, high voltage analysis tools used, high voltage safety systems, and 12 volt systems used in hybrid and electric vehicles. Hands-on application to safety disconnect, use of high voltage analysis tools to perform basic checks, and perform service and preventive maintenance on hybrid and electric vehicles.",
    "num_units": "3",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 6 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in AMT 171 or automotive industry work experience with instructor's approval."
  },
  {
    "course_prefix": "AMT",
    "course_number": "173",
    "course_title": "HEV III – Diagnostic and Repair",
    "course_desc": "This course is designed to familiarize the student with hybrid and electric vehicle safety, hybrid internal combustion engines (ICE), hybrid transmissions, parallel/series, power inverter system, AC induction electric machines, permanent magnet electric motors theory and construction, and battery pack construction. Hands-on application to safety disconnect, use of high voltage analysis tools to perform diagnostic tests on high voltage insulation failures, electric motor failures, battery failures, and differentiate between an ICE failure and an electric machine failure. Perform battery pack testing and reconditioning.",
    "num_units": "3",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 6 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in AMT 171 or automotive industry work experience with instructor's approval."
  },
  {
    "course_prefix": "AMT",
    "course_number": "177",
    "course_title": "Automotive Diesel Fuel System",
    "course_desc": "This course is designed to provide the student with technical knowledge and skill in servicing and troubleshooting the fuel injector system of the automotive diesel engine.",
    "num_units": "2",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 3 lab; Semester Offered: Fall; Prerequisites: \"C\" or higher in AMT 129 or automotive industry work experience with instructor’s approval."
  },
  {
    "course_prefix": "AMT",
    "course_number": "240",
    "course_title": "Fuel and Emission Systems",
    "course_desc": "This course covers the principles of operation, diagnosis, and repair of fuel systems and emission systems. Carburetion, fuel injection, supercharging, turbocharging, fuel pumps, electronic control, and emission control systems are examined. Diagnostic and repair procedures are performed using automotive tools and testing equipment.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall; Prerequisites: “C” or higher in AMT 241."
  },
  {
    "course_prefix": "AMT",
    "course_number": "241",
    "course_title": "Electrical/Electronic Systems II",
    "course_desc": "This course covers essential theories and practical skills in diagnosing electronic control systems, networking, and repairing automotive accessory circuits such as power windows, power door locks, power antennas, power mirrors, audio systems, anti-theft systems, power seats, horns, blower fan, and wiper/washer. Also covered are conventional instrumentation, digital instrumentation, supplemental inflatable restraint (SRS), and high voltage systems.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in AMT 141."
  },
  {
    "course_prefix": "AMT",
    "course_number": "242",
    "course_title": "Engine Performance I",
    "course_desc": "This course covers diagnosis of engine mechanical systems, electrical systems, fuel system delivery (pumps, regulators), fuel injectors, ignition systems, and emission control systems using digital storage oscilloscopes, scanners, and various electronic testers.",
    "num_units": "5",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 10 lecture/lab; Semester Offered: Fall; Prerequisites: “C” or higher in AMT 129 and AMT 240."
  },
  {
    "course_prefix": "AMT",
    "course_number": "244",
    "course_title": "Engine Performance II",
    "course_desc": "Computer engine management systems of domestic and foreign cars are studied in this course. Theories on operation, diagnosis and repair of sensors, actuators, and onboard computers are covered. The use of scanners, digital storage oscilloscopes, digital graphing multi-meters, and DVOMs are also covered.",
    "num_units": "5",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 9 lab; Semester Offered: Spring; Prerequisites: “C” or higher in AMT 242."
  },
  {
    "course_prefix": "AMT",
    "course_number": "260",
    "course_title": "Diagnostic and Repair",
    "course_desc": "This course is designed to provide the student with realistic on-the-job types of training on automotive vehicles. Students will be exposed to different types of live jobs to build self-confidence, improve their approach to troubleshooting, and improve their skills of the trade with emphasis on accuracy, neatness, and speed.",
    "num_units": "4",
    "dept_name": "Automotive Mechanics Technology (AMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 9 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in AMT 144, AMT 145, AMT 149, AMT 152, AMT 154, and AMT 244."
  },
  {
    "course_prefix": "ANTH",
    "course_number": "200",
    "course_title": "Cultural Anthropology",
    "course_desc": "This course is an orientation on the nature of culture and basic concepts for analyzing cultural behavior.",
    "num_units": "3",
    "dept_name": "Anthropology (ANTH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ANTH",
    "course_number": "220",
    "course_title": "Prehistory of Hawai‘i",
    "course_desc": "This course studies prehistoric Hawaiian culture through legendary, archaeological, ethnographic, and historic sources. Prehistory of Hawai‘i is designed for the layperson who is interested in a general course on the culture of Hawai‘i prior to 1778. This course also focuses on the early human use of and adaptation to the geography and environment of these islands.",
    "num_units": "3",
    "dept_name": "Anthropology (ANTH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ART",
    "course_number": "101",
    "course_title": "Introduction to the Visual Arts",
    "course_desc": "This course is a general introduction to the media, techniques, and history of the visual arts, oriented to students who have not been exposed to the formal study of these disciplines. Students will develop an in-depth appreciation of the creative processes involved in the visual arts across cultures and throughout history. This survey course reviews two- and three-dimensional art forms, methods, and media; examines the visual elements and principles of design; and surveys art styles from the prehistoric to the 20th Century.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ART",
    "course_number": "105",
    "course_title": "Introduction to Ceramics",
    "course_desc": "This course introduces students to creating three-dimensional concepts in clay, emphasizing hand-building, glazing techniques, and surface treatments. Students will complete a variety of hand-building projects, learning the fundamentals of ceramics. Students may opt to also learn how to use a kiln for firing hand-built class projects. Note that this course does not include wheel-throwing, but prepares students for learning that skill in a subsequent course.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Comments: May be repeated for a maximum of 9 credits."
  },
  {
    "course_prefix": "ART",
    "course_number": "107",
    "course_title": "Introduction to Digital Photography",
    "course_desc": "This course teaches basic skills to create eye-appealing photographs for print and digital distribution. Working individually and collaboratively, students learn how to operate cameras, lights, and software applications to create and edit visually-appealing photographs. Students also create web-based Digital Portfolios to display photographs.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ART",
    "course_number": "111",
    "course_title": "Introduction to Watercolor Painting",
    "course_desc": "This course is an introduction to the theory and practice of watercolor painting. Students will learn about the use of watercolor materials and wet and dry painting techniques, including applying  washes, glazing, lifting, scraping, and creating blends. They also will concentrate on painting composition, paint consistency, and color development within the context of practicing and improving their technical painting skills.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring (every odd year)"
  },
  {
    "course_prefix": "ART",
    "course_number": "112",
    "course_title": "Introduction to Digital Arts",
    "course_desc": "In this course, students are introduced to the writing and planning skills, industry-standard equipment, and software applications necessary to design and create projects in Website Technology, Still Photography, Graphic Arts, Video Production, and Animation. Students learn essential foundational knowledge for all facets of the Creative Media program.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ART",
    "course_number": "113",
    "course_title": "Introduction to Drawing",
    "course_desc": "This course involves students in two-dimensional visualization and rendering of forms, spaces, and ideas through a variety of approaches and media. Students learn the basics of line, contour, shading, texture, perspective, composition, and action drawing. Students will create several original works of art and compile a portfolio of their drawings at the end of the term.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Comments: Students in the Creative Media program pursuing a certificate in Animation or Graphic Art are encouraged to take this course."
  },
  {
    "course_prefix": "ART",
    "course_number": "123",
    "course_title": "Introduction to Painting",
    "course_desc": "This course teaches the fundamentals of painting to beginning painting students. Students will explore the technical and expressive possibilities of the paint media. The class will focus on the formal, conceptual, and technical problems in painting. Emphasis will be given to color mixing systems and successfully manipulating paint as a medium for self-expression.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ART",
    "course_number": "125",
    "course_title": "Introduction to Graphic Design",
    "course_desc": "This course teaches entry-level skills required to design and create basic graphics and illustrations for print and digital distribution. Working individually and collaboratively, students use professional development tools and applications to design and create effective graphics and illustrations. Students also create web-based Digital Portfolios to display their projects.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ART",
    "course_number": "175",
    "course_title": "Survey of Global Art I",
    "course_desc": "This course addresses art produced in Asia, Africa, Native America, Europe, and the Pacific Islands, from prehistory to the 15th century. Religious and philosophical ideas expressed in architecture, painting, prints, sculpture, applied art, body art, and textiles are the course focus.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "ART",
    "course_number": "176",
    "course_title": "Survey of Global Art II",
    "course_desc": "This course addresses art produced in Asia, Africa, Native America, Europe, and the Pacific Islands, from 15th century to the present. Religious and philosophical ideas expressed in architecture, painting, prints, sculpture, applied art, body art, and textiles are the course focus.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "ART",
    "course_number": "202",
    "course_title": "Digital Imaging",
    "course_desc": "This course explores digital imaging tools, aesthetics, and workflows, with an emphasis on preparing images for print and digital distribution. Students will gain hands-on experience with industry-standard image editing software and develop proficiency in image processing, illustration, and compositing.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in ART 112."
  },
  {
    "course_prefix": "ART",
    "course_number": "207",
    "course_title": "Intermediate Digital Photography",
    "course_desc": "This course teaches intermediate-level digital photography and postproduction skills required to create professional photographs for print and digital distribution. Students will gain hands-on experience with interchangeable lens cameras and explore professional photographic workflows with an emphasis on RAW capture. The course will deepen students’ understanding of the history of photography and popular photographic genres.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 4 studio; Semester Offered: Spring; Prerequisites: “C” or higher in ART 107D."
  },
  {
    "course_prefix": "ART",
    "course_number": "211",
    "course_title": "Intermediate Watercolor",
    "course_desc": "This course is a continuation of ART 111 that provides intensive application of basic techniques. Emphasis is placed on the development of a personal style in the medium of watercolor.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ART 111.; Comments: May be repeated for a maximum of 6 credits."
  },
  {
    "course_prefix": "ART",
    "course_number": "213",
    "course_title": "Intermediate Drawing",
    "course_desc": "This course has an emphasis on the development of intermediate drawing skills especially the use of color. There will be an emphasis on the power of observation from life. This course introduces students to the intermediate skills and elements of descriptive drawing with some abstraction later in the semester. Students will become familiar with the basic vocabulary and conventions of objective drawing processes and media while practicing an enhanced perceptual awareness and eye/hand motor skills.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ART 113."
  },
  {
    "course_prefix": "ART",
    "course_number": "223",
    "course_title": "Intermediate Painting",
    "course_desc": "This course provides an overview of the origins, influences, development, and impact of major artistic movements in Europe and the U.S. Students will paint with an emphasis on familiarizing themselves with the subject matter, styles, techniques, and intentions of famous artists from these movements to further develop the skills they learned in ART 123.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ART 123."
  },
  {
    "course_prefix": "ART",
    "course_number": "225",
    "course_title": "Intermediate Graphic Design",
    "course_desc": "This course teaches intermediate-level skills required to design and create professional graphics and illustrations for print and digital distribution. Working individually and collaboratively, students use industry-standard development tools and applications to design and create commercial-quality graphics and illustrations.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ART 125."
  },
  {
    "course_prefix": "ART",
    "course_number": "243",
    "course_title": "Intermediate Ceramics: Handbuilding",
    "course_desc": "This course introduces students to advanced techniques in hand building. Non-functional, sculptural concepts will be emphasized and students will be encouraged to challenge themselves to create larger forms than in ART 105. Kiln operations and glaze creation also will be introduced.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in ART 105."
  },
  {
    "course_prefix": "ART",
    "course_number": "244",
    "course_title": "Intermediate Ceramics: Wheel Throwing",
    "course_desc": "This course is a comprehensive introduction to the art of wheel throwing. Students will experience the creating of vessels through the use of the ceramic wheel. Beginning with the simple cylinder, students will learn to expand their skills while creating various forms with the round bottle as a final target of accomplishment. Kiln operations and glaze creation also will be introduced.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in ART 105."
  },
  {
    "course_prefix": "ART",
    "course_number": "250",
    "course_title": "Film and World History Since WWII",
    "course_desc": "This course examines historical events, from WWII until the present, through cinema. In this course students will learn how to use films as a historical source, as well as how world events and culture have shaped the direction of cinema.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Comments: Cross-listed with HIST 250."
  },
  {
    "course_prefix": "ART",
    "course_number": "293",
    "course_title": "Internship",
    "course_desc": "This course allows students to apply the knowledge and skills acquired in the classroom to the work environment. This work experience improves the skills of students and increases their ability to gain steady freelance or full-time employment after graduation.",
    "num_units": "3",
    "dept_name": "Art (ART)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 credits = 225 hours of work experience; Semester Offered: Spring; Prerequisites: \"C\" or higher in ART 112. Approval of instructor."
  },
  {
    "course_prefix": "ASTR",
    "course_number": "110",
    "course_title": "Survey of Astronomy",
    "course_desc": "This course is an introduction to the astronomical universe including planets, our Sun and Solar System, stars, galaxies, cosmology, and the universe. The focus is on the structure, evolution and dynamics of the physical universe and how properties of light can be used, for example, to determine distance, temperature, composition, and relative speed of nearby stars.",
    "num_units": "3",
    "dept_name": "Astronomy (ASTR)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 100."
  },
  {
    "course_prefix": "BIOL",
    "course_number": "100",
    "course_title": "Human Biology",
    "course_desc": "This general science course emphasizes basic science concepts by studying human anatomy and physiology. The course introduces students to the structure and function of cells, tissues, organs, and systems of the human body. This course includes a study of the disease process and recent scientific advances.",
    "num_units": "3",
    "dept_name": "Biology (BIOL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "BIOL",
    "course_number": "110",
    "course_title": "Projects in Biology",
    "course_desc": "This class offers the opportunity to use equipment, techniques, or materials not ordinarily used in regular biology courses. The student will be actively involved with developing procedures, making adaptations, and constructing an apparatus used in the course. This class is project based and directed studies.",
    "num_units": "1",
    "dept_name": "Biology (BIOL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: Meetings arranged; Semester Offered: Fall, Spring; Prerequisites: \"B\" or higher in BIOL 171, BOT 101, BOT 130, MICR 130, and SCI 121. Approval of instructor.; Comments: May be repeated once for a maximum of 4 credits."
  },
  {
    "course_prefix": "BIOL",
    "course_number": "171",
    "course_title": "Introduction to Biology I",
    "course_desc": "This course covers introductory biology with a marine emphasis for all life science majors including cell structure, chemistry, growth, reproduction, genetics, evolution, viruses, bacteria, and simple eukaryotes. It is taught with a molecular and cellular focus.",
    "num_units": "3",
    "dept_name": "Biology (BIOL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Comments: Cross-listed with MARE 171."
  },
  {
    "course_prefix": "BIOL",
    "course_number": "172",
    "course_title": "Introduction to Biology II",
    "course_desc": "BIOL/MARE 172 is a continuation of BIOL/MARE 171 emphasizing anatomy, physiology, and systematic of plants and animals to include behavior, ecosystems, populations, and communities.",
    "num_units": "3",
    "dept_name": "Biology (BIOL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in BIOL 171 and BIOL 171L.; Comments: Cross-listed with MARE 172."
  },
  {
    "course_prefix": "BLAW",
    "course_number": "200",
    "course_title": "Legal Environment of Business",
    "course_desc": "This course introduces fundamental principles of law as applied to ordinary business relationships, sources of business law, the essential elements of a contract, the agency and employment relationships, negotiable instruments, bailments, personal property, and the sale of personal property. Emphasis is placed on the Uniform Commercial Code.",
    "num_units": "3",
    "dept_name": "Business Law (BLAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "BLPR",
    "course_number": "122",
    "course_title": "Blueprint Reading",
    "course_desc": "This course is designed to help students acquire an understanding of the basic principles in blueprint reading. Emphasis is on developing interpretation and visualization techniques as they refer to construction drawings and concepts essential to related fields in carpentry, architecture, engineering, and green construction technology.",
    "num_units": "3",
    "dept_name": "Blueprint (BLPR)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "BOT",
    "course_number": "101",
    "course_title": "General Botany",
    "course_desc": "This course covers the structure, growth, functions, and evolution of plants and their relationship to the environment and human activities. The course will give the student an overall view of the plant kingdom and the integral part that they play in life.",
    "num_units": "3",
    "dept_name": "Botany (BOT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "BOT",
    "course_number": "105",
    "course_title": "Ethnobotany",
    "course_desc": "The course focuses on the importance of plants and their influence upon the cultures of Hawai‘i and the Pacific. Students learn traditional and contemporary use of cultivated and wild plants.",
    "num_units": "3",
    "dept_name": "Botany (BOT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Comments: Cross-listed with HWST 211."
  },
  {
    "course_prefix": "BOT",
    "course_number": "130",
    "course_title": "Plants in the Hawaiian Environment",
    "course_desc": "This course is an introduction to the biological sciences demonstrated through the study of the evolution of plant species and communities of the Hawaiian Islands. The course will include the study of ecological interactions, human impact on the environment, observational skills and scientific inquiry, plant structure and form in relation to function, and the identification and systematics of native and introduced flora.",
    "num_units": "3",
    "dept_name": "Botany (BOT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring"
  },
  {
    "course_prefix": "BUS",
    "course_number": "120",
    "course_title": "Principles of Business",
    "course_desc": "This course surveys the fundamentals of the American business enterprise and examines the foundations and responsibilities of accounting, business, management, finance, marketing, and the business environment.",
    "num_units": "3",
    "dept_name": "Business (BUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "BUS",
    "course_number": "190",
    "course_title": "Survey of International Business",
    "course_desc": "This course focuses on general business problems, techniques and strategies necessary in the development of business activities in the global market place. The course is designed to promote an understanding of the impact that a country's culture and its environment have on a firm's international operations. The course also covers current trends in management, finance, communication, marketing and ethics.",
    "num_units": "3",
    "dept_name": "Business (BUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in BUS 120."
  },
  {
    "course_prefix": "BUS",
    "course_number": "293",
    "course_title": "Cooperative Education",
    "course_desc": "Cooperative Education is a supervised field experience that is related to the student's major or career goals. The experience will enable the student to apply knowledge and skills learned in coursework to the business environment.",
    "num_units": "3",
    "dept_name": "Business (BUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 credits = 225 hours of work experience; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in ENT and MGT courses. Business program major. Approval of instructor."
  },
  {
    "course_prefix": "CARP",
    "course_number": "99",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "3",
    "dept_name": "Carpentry (CARP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Fall (every odd year); Prerequisites: “C” or higher or concurrent enrollment in CARP 120B."
  },
  {
    "course_prefix": "CARP",
    "course_number": "120",
    "course_title": "Basic Carpentry Skills",
    "course_desc": "This course provides an overview of the tools, materials, and safety practices currently used in the industry. The safe use, care, and maintenance of hand tools and power tools are emphasized.",
    "num_units": "3",
    "dept_name": "Carpentry (CARP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Fall (every odd year)"
  },
  {
    "course_prefix": "CARP",
    "course_number": "122",
    "course_title": "Concrete Forms I",
    "course_desc": "This course focuses on the theory of concrete form construction. Topics include the study of concrete and concrete products, and the differences between concrete and cement. Students will study on the job site safety, and the safety hazards associated with working with concrete and cement.",
    "num_units": "3",
    "dept_name": "Carpentry (CARP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Fall (every even year)"
  },
  {
    "course_prefix": "CARP",
    "course_number": "141",
    "course_title": "Rough Framing and Exterior Finish I",
    "course_desc": "This course covers theories on home construction. It includes the techniques and skills applicable to measurements, building materials, finishes, and safety.",
    "num_units": "3",
    "dept_name": "Carpentry (CARP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Spring (every even year)"
  },
  {
    "course_prefix": "CARP",
    "course_number": "142",
    "course_title": "Finishing I",
    "course_desc": "In this course, students are introduced to the basic concepts of finishing interior surfaces of a home. Students will learn the types of finishes appropriate to various living spaces of their home, how to measure and calculate the square footage of the different rooms of their home, and how to draw to scale various interior wall sections of their homes.",
    "num_units": "3",
    "dept_name": "Carpentry (CARP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Spring (every odd year)"
  },
  {
    "course_prefix": "CHEM",
    "course_number": "151",
    "course_title": "Elementary Survey of Chemistry",
    "course_desc": "This survey of general principles and descriptive chemistry is intended for students with no previous background in chemistry. Topics include atoms and molecules; moles and formulas; properties of solids, liquids, and gases; enthalpy and entropy; acids and bases; chemical composition; stoichiometry; and equilibria.",
    "num_units": "3",
    "dept_name": "Chemistry (CHEM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100. \"C\" or higher in MATH 75X or MATH 82X."
  },
  {
    "course_prefix": "CHEM",
    "course_number": "161",
    "course_title": "General Chemistry I",
    "course_desc": "This course is an introduction to the basics of college chemistry. Topics include chemical kinetics, chemical equilibrium, acid-bases, acid-base equilibrium, solubility equilibrium, entropy, electrochemistry, coordination, and nuclear chemistry.",
    "num_units": "3",
    "dept_name": "Chemistry (CHEM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 103."
  },
  {
    "course_prefix": "CHEM",
    "course_number": "162",
    "course_title": "General Chemistry II",
    "course_desc": "CHEM 162 is a continuation of CHEM 161. This course introduces additional basic principles of chemistry including kinetics, equilibrium, pH, redox reactions, electrochemistry, acid-base chemistry, gas laws, electrolytes, thermodynamics, matter and changes of state, and nuclear chemistry.",
    "num_units": "3",
    "dept_name": "Chemistry (CHEM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in CHEM 161."
  },
  {
    "course_prefix": "CM",
    "course_number": "110",
    "course_title": "Introduction to Music Production",
    "course_desc": "This introductory course teaches basic concepts and procedures required to operate audio equipment in a recording studio. Topics include digital audio theory, dynamic processing, acoustics, mixers, multi-track recordings, studio session procedures, miking techniques, mixer signal flow, audio monitoring equipment, and MIDI devices.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "CM",
    "course_number": "120",
    "course_title": "Introduction to Digital Video",
    "course_desc": "In this course, students develop basic video production skills. The course emphasizes the technical aspects of digital cinematography and sound recording, plus fundamentals of field production in terms of conceptual development, planning, writing, storyboarding, editing, and project management. Students also learn the basic rules of visual composition, sequencing, and storytelling.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "CM",
    "course_number": "156",
    "course_title": "Writing for Media",
    "course_desc": "The course will explore the fundamentals of storytelling through the modalities of scriptwriting, copywriting, and ad writing. Students will gain hands-on experience crafting engaging narratives that connect with audiences and reflect industry-standard formats.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "CM",
    "course_number": "170",
    "course_title": "Introduction to Event Technology",
    "course_desc": "This course teaches entry-level skills required to support live events. Working individually and collaboratively, students learn how to set up, safely operate, and store professional sound, lighting, staging, and visual display equipment.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "CM",
    "course_number": "178",
    "course_title": "Introduction to 3D Animation",
    "course_desc": "This course teaches entry-level skills required to design and create basic 3-dimensional, animated graphic sequences. The course covers general design and production as the students work through the different stages of the animation pipeline (art, modeling, surfacing, camera, animating, lighting, and rendering). Students also create web-based Digital Portfolios to display completed animated sequences.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "CM",
    "course_number": "180",
    "course_title": "Introduction to Website Technology",
    "course_desc": "This course teaches entry-level design and development skills required to create basic websites. Students use professional software applications to create websites that are user friendly, visually appealing, and scalable. Lessons provide an overview of Cascading Style Sheets (CSS), Hypertext Markup Language (HTML), and Javascript.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "CM",
    "course_number": "210",
    "course_title": "Intermediate Music Production",
    "course_desc": "This intermediate-level course teaches how to use Pro Tools to complete projects from initial setup to mix-down. Hands-on assignments teach how to record, edit, and mix soundtracks from multi-track recordings of live instruments and MIDI sequencing of software synthesizers.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in CM 110."
  },
  {
    "course_prefix": "CM",
    "course_number": "220",
    "course_title": "Intermediate Digital Video",
    "course_desc": "This course examines the technical and aesthetic issues of digital video production at the intermediate level. Lessons include production management, directing actors, script writing, storyboard production, video camera operation, sound recording, lighting, and editing techniques. Working individually and collaboratively, students use professional video cameras, lights, audio equipment, and editing software to produce commercial-quality video programs.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in CM 120."
  },
  {
    "course_prefix": "CM",
    "course_number": "280",
    "course_title": "Intermediate Website Technology",
    "course_desc": "In this course, students use industry-standard development applications to design and create professional websites that are user friendly, visually appealing, scalable, and ADA compliant. This course also covers how to customize websites using Cascading Style Sheets (CSS), Hypertext Markup Language (HTML) and Javascript.",
    "num_units": "3",
    "dept_name": "Creative Media (CM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in CM 180."
  },
  {
    "course_prefix": "CULN",
    "course_number": "100",
    "course_title": "Math for the Culinary Arts",
    "course_desc": "This course introduces the quantitative methods, reasoning, and operations necessary to perform tasks and solve problems needed by culinary professionals. The quantitative methods covered include computation measurement, ratio, proportion and percent; conversions, recipe scaling, yield percent and recipe costing; baker's percentage and kitchen ratios; purchasing; and proportioning. Applications include interpretation and analysis of quantitative information needed in culinary situations.",
    "num_units": "3",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring"
  },
  {
    "course_prefix": "CULN",
    "course_number": "101",
    "course_title": "Introduction to Food Service, Basic Skills, and Sanitation",
    "course_desc": "This course will provide an overview of the rapidly growing food service industry from entry level to management positions. Students will learn the basic skills needed to enter an entry-level position with an emphasis on sound work ethics and attitudes required to seek employment in the food service industry.",
    "num_units": "4",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 6 lecture/lab; Semester Offered: Fall"
  },
  {
    "course_prefix": "CULN",
    "course_number": "102",
    "course_title": "Introduction to Food Service, Breakfast Cookery, and Cafeteria Service",
    "course_desc": "This course will provide an overview of the rapidly growing food service industry with the basic skills needed to enter an entry level position with an emphasis on sound work ethics and attitude required to seek employment in the food service industry. This course emphasizes high production standards, attractive service, use of proper equipment, and efficient use of time. The course also stresses food selection, proper food storage/sanitation, and recipe and product evaluations. This course introduces students to breakfast short order cooking concepts and includes instruction and practical application in the following: eggs cooked to order, omelets, pancakes, waffles, French toast, and hot cereals. Students will also be trained in offering weekly specials for cafeteria operation.",
    "num_units": "4",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 6 lecture/lab; Semester Offered: Spring"
  },
  {
    "course_prefix": "CULN",
    "course_number": "111",
    "course_title": "Introduction to the Culinary Industry",
    "course_desc": "This course provides an overview of the culinary industry within the aspects of the entire hospitality industry. It provides students with an introduction to the historical, social, and cultural forces that have affected and shaped the industry of today. Students will identify job qualifications and opportunities, professional standards, communication skills, and attitudes essential for successful workers in the industry.",
    "num_units": "2",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "CULN",
    "course_number": "112",
    "course_title": "Sanitation and Safety",
    "course_desc": "This course is the study and application of principles and procedures of sanitation and safety in the\n                hospitality industry. This course includes the study of foodborne illnesses, biological hazards,\n                chemical hazards, physical hazards, and cross-contamination as they may occur during the flow of food.\n                An introduction to Hazard Analysis Critical Control Point (HACCP) and other sanitation and safety\n                programs will also be presented. Safety issues and Occupational Safety and Health Administration (OSHA)\n                guidelines and standards will be covered as they apply to the hospitality industry.",
    "num_units": "2",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 106."
  },
  {
    "course_prefix": "CULN",
    "course_number": "115",
    "course_title": "Menu Merchandising",
    "course_desc": "This course is a study of the factors involved in planning effective menus for a variety of food service operations. This course includes the design, format, selection, costing, pricing, and balance of menu items based on an understanding of the needs of various target markets.",
    "num_units": "2",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in CULN 271. \"C\" or higher in CULN 100 or MATH 100."
  },
  {
    "course_prefix": "CULN",
    "course_number": "116",
    "course_title": "Introduction to Culinary Sustainability",
    "course_desc": "This course overviews a variety of sustainable practices, and examines how to implement them in a foodservice operation. Students will learn to combine elements of purchasing/receiving, energy and water conservation, and recycling to help control costs while reaping the benefits of being good environmental stewards.",
    "num_units": "1",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "CULN",
    "course_number": "121",
    "course_title": "Culinary Fundamentals",
    "course_desc": "This course is an introduction to the basic concepts, skills, and techniques of food preparation. Course competencies includes fundamental cooking methods and formulas for stocks, soups, sauces, meats, seafood, poultry, vegetables, and starches. Students will learn to identify, use, and maintain ingredients, equipment, tools, and utensils in a safe and sanitary manner.",
    "num_units": "4",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 9 lab and 2 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in CULN 112. Qualified for ENG 106 and MATH 82X."
  },
  {
    "course_prefix": "CULN",
    "course_number": "130",
    "course_title": "Intermediate Cookery",
    "course_desc": "This course focuses on the application of basic concepts, skills, and techniques in fundamentals of cookery, short order cookery (including breakfast cookery as found in coffee shops, snack bars, and other quick service outlets with an emphasis in American Regional Cuisine), and quantity food production with emphasis on menu development, recipe standardization and conversion, and quality control. This course also includes experience in both quantity food production and short order cookery.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 9 lab and 2 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher in CULN 121."
  },
  {
    "course_prefix": "CULN",
    "course_number": "150",
    "course_title": "Fundamentals of Baking",
    "course_desc": "This course is an introduction to the fundamental concepts, skills, and techniques of basic baking. Special emphasis is placed on the study of ingredient functions, product identification, weights, measures, and proper use and maintenance of bakeshop tools and equipment. Students identify the basic baking concepts and techniques in preparing items such as quick breads, yeast breads, pies, cakes, cookies, dessert sauces, custards, and creams.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 9 lab and 2 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in CULN 130."
  },
  {
    "course_prefix": "CULN",
    "course_number": "160",
    "course_title": "Dining Room Operations",
    "course_desc": "This course is the study and application of the variety of service styles and techniques practiced by industry with special emphasis on the importance of the relationship coordination between the front and the back of the house. It includes the study of the principles, practices, responsibilities and liabilities associated with alcohol service.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture, 2 lecture/lab, and 9 lab; Semester Offered: Spring; Prerequisites: “C” or higher in CULN 150."
  },
  {
    "course_prefix": "CULN",
    "course_number": "185",
    "course_title": "Culinary Nutrition",
    "course_desc": "This course provides a practical and systematic approach in developing a philosophy about healthful eating. It also provides the necessary guidelines for recipe adaptation and menu planning.",
    "num_units": "3",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 106 and MATH 82X."
  },
  {
    "course_prefix": "CULN",
    "course_number": "221",
    "course_title": "Continental Cuisine",
    "course_desc": "This course focuses on expanding competencies gained in Fundamentals of Cookery, Intermediate Cookery, and other prior culinary courses, emphasizing creativity and the refining and perfecting of skills and techniques acquired. Students specialize in cooked-to-order dishes typically served in hotels and fine dining restaurants with special emphasis on the classical cuisines. This course also covers the preparation and presentation of Continental and European cuisines.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture, 2 lecture/lab, and 9 lab; Semester Offered: Fall; Prerequisites: “C” or higher in CULN 150 and CULN 160."
  },
  {
    "course_prefix": "CULN",
    "course_number": "222",
    "course_title": "Asian Pacific Cuisine",
    "course_desc": "This course focuses on basic classical Asian/Pacific cookery techniques that have evolved into the culinary concepts and flavors utilized in Pacific Rim and Hawai‘i Regional cuisine. Through the production of the contemporary menu, students learn about cooking techniques, specialty ingredients, seasonal foods, spices, and herbs.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture, 2 lecture/lab, and 9 lab; Semester Offered: Fall; Prerequisites: “C” or higher in CULN 221."
  },
  {
    "course_prefix": "CULN",
    "course_number": "242",
    "course_title": "Applied Garde Manger",
    "course_desc": "This course is a study of the basic Garde Manger principles as well as the functions and duties of the department as it relates to and integrates with other kitchen operations. The preparation of specialty items such as aspics, chaud-froids, forcemeat, pates, terrines, galantines, mousses, as well as ice sculpturing, tallow sculpturing, and fruit and vegetable carving will be covered in this seven and a half week course.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture, 2 lecture/lab, and 9 lab; Semester Offered: Spring; Prerequisites: “C” or higher in both CULN 221 and CULN 222 or approval of instructor."
  },
  {
    "course_prefix": "CULN",
    "course_number": "271",
    "course_title": "Purchasing and Cost Control",
    "course_desc": "In this course, students will analyze purchasing and food control systems in commercial food service operations. Students will practice cost and sales analysis, comparative buying, and inventory control.",
    "num_units": "4",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Fall; Prerequisites: Qualified for MATH 100 or approval of instructor."
  },
  {
    "course_prefix": "CULN",
    "course_number": "275",
    "course_title": "Human Resource Management and Supervision",
    "course_desc": "This course is designed to prepare the student for the transition from employee to supervisor in a food service operation. Students will learn to identify and evaluate various leadership styles and techniques. Course content also includes employee training, motivation, and evaluation techniques common in food service operations.",
    "num_units": "3",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in CULN 271. Qualified for either ENG 100 or ENG 106."
  },
  {
    "course_prefix": "CULN",
    "course_number": "294",
    "course_title": "Culinary Arts Practicum",
    "course_desc": "This capstone course is designed to integrate culinary training with academic studies and field experience using fundamental cooking techniques, food science, aesthetics, managerial principles, and sensory perception as the framework. Students will plan, organize, staff, direct, and control a restaurant on campus. They will be responsible for menu designs, service, finances, purchasing, and productivity. The instructor serves as a resource in the areas of market analysis, menu creation and design, cost control, and financial analysis.",
    "num_units": "5",
    "dept_name": "Culinary Arts (CULN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 9 lab and 2 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in CULN 115, CULN 185, CULN 242, and CULN 271; or approval of instructor."
  },
  {
    "course_prefix": "ECE",
    "course_number": "160",
    "course_title": "Programming for Engineers",
    "course_desc": "This is an introductory course on computer programming and modern computing environments with an emphasis on algorithm and program design, implementation and debugging. Designed for engineering students, this course includes a hands-on laboratory to develop and practice programming skills.",
    "num_units": "4",
    "dept_name": "Electrical & Computer Engineering (ECE)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 241."
  },
  {
    "course_prefix": "ECE",
    "course_number": "211",
    "course_title": "Basic Circuit Analysis I",
    "course_desc": "This course studies Laplace transforms, Fourier transforms, convolution and the applications to circuits, frequency selective circuits, design of active filters, and state space analysis of circuits.",
    "num_units": "4",
    "dept_name": "Electrical & Computer Engineering (ECE)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Fall, Spring; Prerequisites: Concurrent enrollment in MATH 243 or qualified for MATH 244."
  },
  {
    "course_prefix": "ECE",
    "course_number": "213",
    "course_title": "Basic Circuit Analysis II",
    "course_desc": "This course studies Laplace transforms, Fourier transforms, convolution and the applications to circuits, frequency selective circuits, design of active filters, and state space analysis of circuits.",
    "num_units": "4",
    "dept_name": "Electrical & Computer Engineering (ECE)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher ECE 211. \"C\" or higher or concurrent enrollment in MATH 244."
  },
  {
    "course_prefix": "ECE",
    "course_number": "296",
    "course_title": "Sophomore Project",
    "course_desc": "Sophomore level individual or team project under ECE faculty direction and guidance. The project provides design experience and develops practical skills.",
    "num_units": "1",
    "dept_name": "Electrical & Computer Engineering (ECE)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated for a maximum of 4 credits."
  },
  {
    "course_prefix": "ECED",
    "course_number": "105",
    "course_title": "Introduction to Early Childhood Education",
    "course_desc": "This course introduces and explores the nature of the field of early childhood education and care.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "110",
    "course_title": "Developmentally Appropriate Practices",
    "course_desc": "This course introduces concepts of developmentally appropriate practice and the importance of play. This course provides an overview of and experience with the knowledge and skills necessary for working with children birth through age eight, including children with special needs.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "115",
    "course_title": "Health, Safety, and Nutrition for the Young Child",
    "course_desc": "This course introduces theories and practices for creating and maintaining a safe, healthy learning environment for young children and adults in group settings. It introduces guidelines and practices for providing for the nutritional needs of young children and adults in group settings.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "131",
    "course_title": "Early Childhood Development: Theory Into Practice",
    "course_desc": "This course introduces principles of human development from conception through age eight and how this informs practice. This course focuses on the relationships between physical, cognitive, emotional, and social aspects of the individual during this period.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "140",
    "course_title": "Guiding Young Children in Group Settings",
    "course_desc": "This course addresses positive ways to support children's social-emotional development. This course focuses on adult-child and child-child interactions and relationships.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in ECED 131. Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "170",
    "course_title": "Introduction to Working with Infants and Toddlers",
    "course_desc": "This course provides an overview of the basic skills needed for working with infants and toddlers and their families in group care settings. This course focuses on interactive aspects of child development and introduces infant-toddler care-giving routines and environments, and caregiver roles.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "191",
    "course_title": "Early Childhood Practicum I",
    "course_desc": "This course provides a mid-program supervised work experience in an early childhood education and care setting. It is designed to support students in integrating content knowledge with practice.",
    "num_units": "4",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher or concurrent enrollment in ECED 140 and ECED 245."
  },
  {
    "course_prefix": "ECED",
    "course_number": "245",
    "course_title": "Child, Family, and Community",
    "course_desc": "This course develops communication skills and other strategies for building effective relationships with diverse families and relevant community members. This course introduces students to the local resources available for family referral.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in ECED 105. Qualified for ENG 100."
  },
  {
    "course_prefix": "ECED",
    "course_number": "263",
    "course_title": "Language and Creative Expression Curriculum",
    "course_desc": "This course addresses creative and language disciplines, stages of development for each, and how these relate to appropriate early childhood curriculum. It includes designing curriculum for language, literacy, literature, and creative expression (art, music, & creative movement/dance) based on observation of children. Students must have contact with preschool children in a formal setting for observation and implementation of course assignments.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in ECED 140, ECED 191, and ECED 245."
  },
  {
    "course_prefix": "ECED",
    "course_number": "264",
    "course_title": "Inquiry and Physical Curriculum",
    "course_desc": "This course addresses physical development and inquiry disciplines, stages of development for each, and how these relate to appropriate early childhood curriculum. It includes designing curriculum for physical development, and inquiry (math, science, and social studies) based on observation of children. The course introduces integrated curriculum based on science and social studies topics. Students must have contact with preschool children in a formal setting for observation and implementation of course assignments.",
    "num_units": "3",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in ECED 105, ECED 110, and ECED 131."
  },
  {
    "course_prefix": "ECED",
    "course_number": "291",
    "course_title": "Early Childhood Practicum II",
    "course_desc": "This course provides a final supervised work experience in an early childhood education and care setting.  It is designed to support students in integrating content knowledge with practice.",
    "num_units": "4",
    "dept_name": "Early Childhood Education (ECED)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in ECED 191."
  },
  {
    "course_prefix": "ECON",
    "course_number": "130",
    "course_title": "Principles of Microeconomics",
    "course_desc": "In this course, students examine the decision-making process of both households and firms. Students also analyze the functioning of a competitive market system, supply and demand models, and the role of government in cases of market failure.",
    "num_units": "3",
    "dept_name": "Economics (ECON)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ECON",
    "course_number": "131",
    "course_title": "Principles of Macroeconomics",
    "course_desc": "This course is an examination of the forces determining levels of and changes in national income, employment and the price level, including the role of government through its fiscal and monetary policies. Additional content critically examines the economic system of capitalism and multinational corporations as powerful macroeconomic institutions.",
    "num_units": "3",
    "dept_name": "Economics (ECON)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "99",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "3",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in in EIMT 135."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "121",
    "course_title": "Electrical Fundamentals",
    "course_desc": "This course introduces students to AC and DC electrical theory and practical concepts, including basic laws and formulas. This course includes how basic circuits are configured and the necessary materials required and the wiring of common electrical devices. Tools and test equipment requirements and simple wiring techniques will be covered.",
    "num_units": "3",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "EIMT",
    "course_number": "123",
    "course_title": "Wiring Materials, Methods, and NEC Codes",
    "course_desc": "This course is an introduction to the National Electrical Code (NEC) requirements for branch circuit wiring. The selection and installation of materials and the methods used following NEC guidelines for common electrical circuits within the home are covered. Selection, sizing, and electrical safety requirements are explained as well as basic troubleshooting skills.",
    "num_units": "3",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "EIMT",
    "course_number": "131",
    "course_title": "Residential Installation Theory",
    "course_desc": "This course is designed to develop knowledge of basic and advanced residential wiring with emphasis on the National Electrical Code, energy efficiency, and the principles of residential blueprint reading.",
    "num_units": "4",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in in EIMT 135."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "135",
    "course_title": "Residential Installation Lab",
    "course_desc": "This course is designed to provide the basic and advanced knowledge in residential wiring techniques. Laboratory exercises are designed to give students practical experience in different wiring techniques and methods.",
    "num_units": "6",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 12 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in EIMT 131."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "145",
    "course_title": "Commercial Installation Theory",
    "course_desc": "This course is designed to develop knowledge of commercial and industrial wiring techniques with emphasis on the National Electrical Code, energy efficiency, and the principles of advanced electrical blueprint reading.",
    "num_units": "4",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in EIMT 147."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "147",
    "course_title": "Commercial Installation Lab",
    "course_desc": "This course is designed to advance the knowledge of commercial and industrial wiring techniques with emphasis on the National Electrical Code, energy efficiency, and the principles of advanced electrical blueprint reading.",
    "num_units": "6",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 12 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in EIMT 145."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "151",
    "course_title": "Industrial Motor Controls",
    "course_desc": "This is an introduction to motor controls and the logic sequence that they implement. The course covers how to read a ladder diagram, including component recognition, use, and application. Students will develop skills to create a computer generated control diagram from a sequence of operations and learn troubleshooting skills to diagnose basic control functions.",
    "num_units": "3",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in EIMT 123."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "153",
    "course_title": "AC/DC Systems and Equipment",
    "course_desc": "This course is designed to advance the student into electrical principles of direct current and alternating current equipment. Emphasis is placed on the theory, operation, control, and power generation of alternative energy systems including photovoltaic, wind, and hydro systems.",
    "num_units": "6",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 12 lecture/lab; Semester Offered: Fall, Spring (once every 3 semesters); Prerequisites: \"C\" or higher or concurrent enrollment in EIMT 121. \"C\" or higher in EIMT 123."
  },
  {
    "course_prefix": "EIMT",
    "course_number": "170",
    "course_title": "Renewable Energy PV",
    "course_desc": "This course is designed to prepare the individual for entry into the photovoltaic field. Emphasis is on photovoltaic technology application, incorporating the electrical principles, solar radiation, load analysis, components of a system, maintenance, and types of systems. Successful completion of the course qualifies an individual to take the North American Board of Certified Energy Practitioners (NABCEP) Basic Entry Level exam.",
    "num_units": "3",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall"
  },
  {
    "course_prefix": "EIMT",
    "course_number": "175",
    "course_title": "Advanced Renewable Energy PV",
    "course_desc": "This course is designed to advance the student in the photovoltaic field using battery technology and stand-alone systems. Emphasis is on the application of photovoltaic systems following the National Electrical Code rules. System sizing, conductor sizing, grounding, and overcurrent protection are covered.  Successful completion of the course satisfies the educational requirements for an individual to take the North American Board of Certified Energy Practitioners (NABCEP) Certification exam.",
    "num_units": "3",
    "dept_name": "Electrical Installation and Maintenance Technology (EIMT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in EIMT 170."
  },
  {
    "course_prefix": "ELI",
    "course_number": "4",
    "course_title": "Reading and Writing American English",
    "course_desc": "This course for non-native speakers of English provides practice in reading comprehension skills, writing strategies and skills, vocabulary development, interpersonal communication skills, and cross-cultural understanding.",
    "num_units": "3",
    "dept_name": "English Language Institute (ELI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: For non-native speakers of English with appropriate test scores (below 8.0 G.E. on Nelson-Denny, or TOEFL score below 500) or recommendation of instructor or counselor."
  },
  {
    "course_prefix": "ENG",
    "course_number": "75",
    "course_title": "Introduction to College Reading and Composition",
    "course_desc": "This course prepares students for college-level reading and composition. It focuses on strengthening reading, critical thinking, and writing skills through practice that progressively becomes more sophisticated. Reading instruction focuses on building vocabulary, improving reading comprehension, and analyzing and synthesizing ideas from academic texts. Students will be given instruction in writing mechanics and guided practice in the writing process. Writing assignments will include shorter informal pieces as well as more formal short essays that develop and support theses logically, incorporating outside sources. Students will also participate in activities and exercises to develop college study and self-management skills that contribute to long-term college success.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: Appropriate English placement."
  },
  {
    "course_prefix": "ENG",
    "course_number": "100",
    "course_title": "Composition I",
    "course_desc": "This course introduces students to the essential rhetorical, conceptual, and stylistic demands of writing in Standard American English at the college level. Instruction in composing processes, research strategies, and writing from sources is a focus of the course. The course also provides students with experiences in the library and on the internet to enhance their skills in accessing and using various types of primary and secondary materials. Students will engage in research activities, evaluate sources, and apply the principles of college writing to produce substantial college-level compositions, building foundation skills for writing in courses across the college curriculum.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Acceptable English placement*.*Smarter Balanced score of 4; or Smarter Balanced score of 3 with a B or higher in 12th Grade ELA course; or Smarter Balanced score of 2 with a B or higher in 12th Grade ELA course jointly approved by HIDOE and UH; or Cumulative HS GPA 2.6 or higher; or a grade of B or higher in 12th Grade ELA course or AP Language & Composition class; or an ACT score of 18 or higher; or an SAT score of 510 or higher in Writing; or a score of 15 or higher on the HiSet College Ready, Language Arts - Writing; or a score of 170 on the GED - Reasoning Through Language Arts; or via writing sample."
  },
  {
    "course_prefix": "ENG",
    "course_number": "104",
    "course_title": "Introduction to Creative Writing",
    "course_desc": "This course is an introduction to the art of creative expression. Types of writing may include poetry, short stories, imaginative essays, and plays. The class offers opportunity for self-expression.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ENG",
    "course_number": "106",
    "course_title": "Technical Communication",
    "course_desc": "This class offers instruction and practice in the specialized reading and writing skills necessary in professional trade and technical settings. The course will emphasize practice in critical thinking, essential information literacy, active reading strategies, and writing clearly, accurately, and correctly. Particular attention will be given to writing reports, reading technical articles, and preparing and delivering presentations within the trade and technical professional environment.",
    "num_units": "4",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ENG 75; acceptable English placement; or instructor approval.; Comments: ENG 106 does not fulfill the English requirement for AA transfer degrees."
  },
  {
    "course_prefix": "ENG",
    "course_number": "200",
    "course_title": "Composition II",
    "course_desc": "This course further develops the writing and research skills covered in Composition I. Students will be given more in-depth instruction in rhetoric, logic, argument, research techniques, and the stylistic demands of writing within a discipline. Particular emphasis will be placed on writing well-researched and well-documented papers.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ENG 100."
  },
  {
    "course_prefix": "ENG",
    "course_number": "270",
    "course_title": "Introduction to Literature: Literary History",
    "course_desc": "This course focuses on the reading and analysis of significant literary texts from a specific historical period. The historical period being emphasized varies from year to year and is specified in the Banner notes accompanying the section CRN. Coursework for all course iterations includes critical thinking skills related to interpreting the significance of the action, characters, themes, and literary devices used by the author. Emphasis is placed on writing, both as a way of discovering ideas and as a way of expressing knowledge of the reading material. Students are expected to be actively engaged in responding to the literature. As students read, discuss, and write about the literature, they should gain a better understanding of themselves and the world they live in. Specific content will vary among course offerings, depending on the particular historical period selected for study.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (once every 3 semesters); Prerequisites: “C” or higher in ENG 100."
  },
  {
    "course_prefix": "ENG",
    "course_number": "271",
    "course_title": "Introduction to Literature: Genre",
    "course_desc": "This course focuses on the reading and analysis of significant literary texts in a selected genre. The literary genre being emphasized varies from year to year and is specified in the Banner notes accompanying the section CRN. Coursework includes critical thinking skills related to interpreting the significance of the action, characters, themes, and literary devices used by the author. Emphasis is placed on writing, both as a way of discovering ideas and as a way of expressing knowledge of the reading material. Students are expected to be actively engaged in responding to the literature. As students read, discuss, and write about the literature, they should gain a better understanding of themselves and the world they live in. The content may vary from topic to topic, depending on the particular works selected for study. Specific content will vary among course offerings, depending on the particular genre selected for study.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (once every 3 semesters); Prerequisites: “C” or higher in ENG 100."
  },
  {
    "course_prefix": "ENG",
    "course_number": "272",
    "course_title": "Introduction to Literature: Literature and Culture",
    "course_desc": "This course studies the theme of Literature and Culture through the reading and analysis of significant works of selected cultures and cultural formations, focusing on the cultural contexts of literary texts. The cultural emphasis of the course varies from year to year and is specified in the Banner notes accompanying the section CRN. Coursework for all course iterations includes critical thinking skills related to interpreting the significance of the action, characters, themes, and literary devices used by the author. Emphasis is placed on writing, both as a way of discovering ideas and as a way of expressing knowledge of the reading material. Students are expected to be actively engaged in responding to the literature. As students read, discuss, and write about the literature, they should gain a better understanding of themselves and the world they live in. Specific content will vary among course offerings, depending on the particular cultural aspect selected for study.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (once every 3 semesters); Prerequisites: “C” or higher in ENG 100."
  },
  {
    "course_prefix": "ENG",
    "course_number": "277",
    "course_title": "Introduction to Literature: Pacific Cultures and Literature: Literature of the Pacific",
    "course_desc": "This class is an introduction to reading and interpreting literature of and about the cultures of the Pacific, including those of Melanesia, Micronesia, and Polynesia. Students will read, analyze, and appreciate works in a variety of literary genres. The class also will consider these works within their cultural, historical, political, and social contexts. Emphasis will be placed upon developing critical thinking skills through class discussion and close readings to improve students' understanding and appreciation of individual texts as well as to illustrate and explore the significance of common and conflicting themes.",
    "num_units": "3",
    "dept_name": "English (ENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (once every 3 semesters); Prerequisites: “C” or higher in ENG 100."
  },
  {
    "course_prefix": "ENT",
    "course_number": "125",
    "course_title": "Starting a Business",
    "course_desc": "This course surveys the business environment, establishing a firm, decision-making processes, marketing assessments, financing, operations considerations, and government regulations. It also covers development of a business plan. It is designed for those who wish to start or are currently operating their own business.",
    "num_units": "3",
    "dept_name": "Entrepreneurship (ENT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ENT",
    "course_number": "130",
    "course_title": "Marketing for the Small Business",
    "course_desc": "This course covers key concepts and issues underlying the modern practice of marketing for the small business. The course provides a clear understanding of marketing's role in the management of a small business including marketing terminology, consumer-oriented approach to marketing, channels of distribution, marketing research, concepts and practices of retailing, wholesaling, physical distribution, marketing communication, personal selling, and marketing organization.",
    "num_units": "3",
    "dept_name": "Entrepreneurship (ENT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ENT",
    "course_number": "150",
    "course_title": "Basic Accounting and Finance for Entrepreneurs",
    "course_desc": "This course introduces accounting concepts and principles, procedures, and systems for the entrepreneur. Application skills include recording, summarizing, reporting, analyzing, and using accounting information for the small business. The development of a financial plan for a small business will incorporate the basic concepts pertaining to financial statements and financial planning.",
    "num_units": "3",
    "dept_name": "Entrepreneurship (ENT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ERTH",
    "course_number": "101",
    "course_title": "Introduction to Geology",
    "course_desc": "This course is a study of the principles of physical geology, the composition and structure of the earth, and the processes shaping the earth’s surface. We’ll study geology as it affects our lives and shapes our landscape including volcanoes, earthquakes, tsunamis, and other processes such as weathering and mountain building that evolve or act over extremely long time periods. The course also explores the very nature of science and scientific inquiry through the unifying theory of plate tectonics, a dramatic example of how new evidence and understanding can revolutionize a scientific discipline.",
    "num_units": "3",
    "dept_name": "Earth Sciences (ERTH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100 and MATH 82X."
  },
  {
    "course_prefix": "ERTH",
    "course_number": "130",
    "course_title": "Geological Hazards",
    "course_desc": "This introductory course covers the causes of, and effects from, earthquakes, tsunamis, volcanic eruptions, landslides, rockfalls, and other natural phenomena.",
    "num_units": "3",
    "dept_name": "Earth Sciences (ERTH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall (every odd year), Spring (every odd year); Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "ERTH",
    "course_number": "214",
    "course_title": "Kaua‘i and Ni‘ihau Field Geology",
    "course_desc": "This four-day field trip course on the island of Kaua‘i studies the volcanological evolution and continuing geological history of Kaua‘i and Ni‘ihau volcanoes. Students traveling from other islands are responsible for air and ground transportation, meals, and lodging.",
    "num_units": "1",
    "dept_name": "Earth Sciences (ERTH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lab; Semester Offered: Fall (every even year), Spring (every even year); Prerequisites: \"C\" or higher in ERTH 101, ERTH 101L, or ERTH 130.; Comments: As with Windward CC, students completing or concurrently enrolled in ERTH 103 (GG 103) \"Geology of the Hawaiian Islands\" will be sufficiently prepared for the course. Students should contact the instructor for approval to enroll."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "101",
    "course_title": "Introduction to Electronics Technology",
    "course_desc": "This course introduces the fundamentals of electronics, computer technology, and electrical components. It also develops applications of basic arithmetic and mathematics to electronic and computer technology, engineering notation, electrical units, and schematic diagrams. Finally, it provides the theory and applications of electronic measuring instruments and the construction of circuits.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall"
  },
  {
    "course_prefix": "ETRO",
    "course_number": "105",
    "course_title": "Circuit Analysis I",
    "course_desc": "This course covers fundamental topics including resistance, and networks, with DC voltage sources and circuit analysis. It also demonstrates Ohm’s law, Kirchoff’s laws, Thevenin’s theorem, and maximum power theorems. Students will develop step-by-step problem solving methods and hands-on laboratory applications and utilize electronics measurement instrumentation and software for data analysis.",
    "num_units": "4",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Fall; Prerequisites: Qualified for MATH 103."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "106",
    "course_title": "Circuit Analysis II",
    "course_desc": "The course teaches practical and theoretical principles of AC circuits and waveforms and reinforces trouble shooting and circuit analysis skills. In addition, magnitude, phase, rectangular and polar forms for sinusoids, impedance, and power vectors will be introduced. Time domain and frequency domain solutions for capacitive and inductive circuits will be studied and filter circuits will be demonstrated.",
    "num_units": "4",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in ETRO 105."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "118",
    "course_title": "General Electronics",
    "course_desc": "This introduction to DC, AC, semi-conductor, and digital electronics includes characteristics, applications, power supplies, and amplifiers. The course also includes the use of the oscilloscope and meters.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 75."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "140",
    "course_title": "Cisco Networking 1",
    "course_desc": "This course introduces the architecture, structure, functions, components, and models of the internet and other computer networks. The principles and structure of IPv4 and IPv6 addressing and the fundamentals of Ethernet concepts, media, and operations are introduced to provide a foundation for the curriculum.  By the end of the course, students will be able to build simple LANs, perform basic configurations for routers and switches, and implement IP addressing schemes.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ETRO",
    "course_number": "143",
    "course_title": "Digital Electronics",
    "course_desc": "This course is an introduction to number systems, codes, logic gates, Boolean algebra, and ICs used in digital circuits. Digital design using both logic gates and the VHDL programming language are studied. Analog-to-digital/digital-to-analog and microprocessor interfacing are introduced.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for MATH 103."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "161",
    "course_title": "Introduction to Optics and Photonics",
    "course_desc": "This introductory photonics course covers the physics of light, laser safety, geometric optics, lenses, mirrors, polarizing lenses, interference/diffraction waves, laser physics, optical imaging, and bio-photonics. Lab experiments and projects are embedded to reinforce the theory and provide practical experience for those interested in pursuing a career in this field.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Spring; Prerequisites: Qualified for ENG 100 and MATH 103."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "199",
    "course_title": "Projects in Electronics",
    "course_desc": "Students in this independent studies course are expected to write a project proposal which states the objectives or scope of the project, materials cost, expected outcomes, and implementation plan. A schedule of lab use time and instructor consultation time should also be included. The project must be documented and a final report is expected.",
    "num_units": "1",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 hours (1 credit), 5 hours (2 credits), 7 hours (3 credits), 9 hours (4 credits); Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated any number of times for credit."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "210",
    "course_title": "Electronic Technology 1",
    "course_desc": "This course introduces basic theory as well as operations of solid-state devices and applies to diodes, bipolar transistors, field effect transistors, Zener diodes, photonic devices, and other semiconductor devices. Students will study electronic circuits performing rectifying and amplification. They will also investigate common amplifier devices and usages, and instrumentation applications.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher in ETRO 106."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "240",
    "course_title": "Cisco Networking 3",
    "course_desc": "This course describes the architecture, components, and operations of routers and switches in larger and more complex networks. Students learn how to configure routers and switches for advanced functionality. By the end of this course, students will be able to configure and troubleshoot routers and switches and resolve common issues with Open Shortest Path First (OSPF), Enhanced Interior Gateway Routing Protocol (EIGRP), and Spanning-Tree Protocol (STP) in both IPv4 and IPv6 networks. Students will also develop the knowledge and skills needed to implement a Wireless Local Area Network (WLAN) in a small-to-medium network.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ETRO 140B and ETRO 140C."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "244",
    "course_title": "Cisco CCNA Security",
    "course_desc": "CCNA Security is a hands-on career-oriented course preparing students with the associate-level knowledge and skills required to secure Cisco networks. Emphasis is placed on the development of a security infrastructure; identification of threats and vulnerabilities to networks; mitigation of security threats; and core security technologies. Students will experience hands-on installation, troubleshooting and monitoring of network devices to maintain integrity, confidentiality, and availability of data and devices.",
    "num_units": "4",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in ETRO 140C or approval of instructor."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "257",
    "course_title": "RF Communications",
    "course_desc": "This course studies the general principles and characteristics of a variety of Radio Frequency (RF) Communications Systems. The coverage includes the analysis of digital and analog communications systems, subsystems, modulation techniques, and circuits. RF communication theory will be reinforced in lab with practical hands- on experience.",
    "num_units": "4",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 8 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in ETRO 106."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "275",
    "course_title": "Fundamentals of Linux",
    "course_desc": "This course introduces the student to fundamentals of the Linux-based system that provides essential services for a local area network. Upon completion of this course, the student will have a basic understanding of the Linux operating system and have hands-on experience installing, managing, and troubleshooting the Linux operating system.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 6 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ICS 101 or approval of instructor."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "280",
    "course_title": "Microprocessor Architecture, Programming, and Interfacing",
    "course_desc": "Microprocessor trainers will be used to introduce microprocessor architecture, interfacing, and machine language programming.  Memory, interfaces, I/O devices, and interrupt processed I/O will also be covered.",
    "num_units": "3",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Acceptance into Electronics Technology program. Qualified for ENG. Qualified for MATH 103."
  },
  {
    "course_prefix": "ETRO",
    "course_number": "287",
    "course_title": "Computer Systems and Networking",
    "course_desc": "This course prepares students for work in maintaining, servicing, troubleshooting, and repairing PCs, peripheral devices, operating systems, as well as communication systems and networks. Students will build, upgrade, install, maintain, and troubleshoot computer and networking hardware. Topics include cabling of voice and data networks, LANs and WANs architecture and protocols, networking devices, wireless networking, and network security.",
    "num_units": "4",
    "dept_name": "Electronics (ETRO)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 3 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in ETRO 105 or ETRO 280."
  },
  {
    "course_prefix": "FENG",
    "course_number": "120",
    "course_title": "Facility Safety and Accident Prevention",
    "course_desc": "This is an introductory course on facility maintenance safety, including the effect it has on productivity and employee morale. The course includes application of a safety program into basic accident prevention. Students will learn and evaluate various federal (Occupational Safety and Health Administration -- OSHA), state, and local laws governing safety. Topics include hazardous chemicals, fall protection, electrical safety, and drugs in the workplace.",
    "num_units": "1",
    "dept_name": "Facilities Engineering Technology (FENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "FENG",
    "course_number": "121",
    "course_title": "Introduction to Building Maintenance",
    "course_desc": "This course in general building and facilities maintenance covers carpentry skills in blueprint reading, measuring, framing, and exterior and roof finishes. This course also covers masonry skills in blue print reading, brick size and texture, types of walls, foundations, anchors, concrete mixes, forms, stone, and plaster. Other topics include troubleshooting, preventive maintenance, and safety.",
    "num_units": "3",
    "dept_name": "Facilities Engineering Technology (FENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in CARP 120B."
  },
  {
    "course_prefix": "FENG",
    "course_number": "123",
    "course_title": "Plumbing Basics and Repair",
    "course_desc": "This course provides an overview of the plumbing systems and the materials, tools, and techniques used in the repair and maintenance of the fixtures and appliances found in a building. Included are safety precautions, tool selection, and an introduction to the codes that apply to a plumbing system.",
    "num_units": "2",
    "dept_name": "Facilities Engineering Technology (FENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 2 lecture/lab; Semester Offered: Spring"
  },
  {
    "course_prefix": "FENG",
    "course_number": "130",
    "course_title": "Basic Fundamentals of Air Conditioning and Refrigeration",
    "course_desc": "This course offers the basic principles and fundamentals of air conditioning and refrigeration. The course is designed to expose students to the theory and methods of maintaining, diagnosing, and minor repairing of domestic and commercial air conditioning/refrigeration systems.",
    "num_units": "3",
    "dept_name": "Facilities Engineering Technology (FENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in EIMT 121 or EIMT 123."
  },
  {
    "course_prefix": "FENG",
    "course_number": "140",
    "course_title": "Commercial Refrigeration and Air Conditioning Diagnostics",
    "course_desc": "This course builds on the skills acquired in the FENG 130, Basic Fundamentals of Air Conditioning and Refrigeration, course. This develops practical skills for technicians, air conditioning and refrigeration helpers, and an introduction to mechanical engineering. This course covers the performance evaluation on working systems under various conditions along with developing refrigerant diagnostic skills. EPA Recovery Certification is required.",
    "num_units": "3",
    "dept_name": "Facilities Engineering Technology (FENG)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in FENG 130."
  },
  {
    "course_prefix": "GIS",
    "course_number": "189",
    "course_title": "GIS, Mapping, and Society",
    "course_desc": "Geographic Information Systems (GIS) is a computerized system used to design, capture, store, manipulate, analyze, manage, and present geographically referenced information or data. It combines cartography, statistical analysis, and databases to manipulate spatial areas for a given application. This introductory course will cover the use and application of GIS combining an overview of general principles of GIS and practical experience in the analytical use of spatial information. Students will gain an overall knowledge of GIS, analyze the social context of mapping and knowledge production, examine the diverse range of GIS applications, and complete a final project with a practical component involving the use of an analytical software package: ArcGIS by ESRI (Environmental System Research Institute).",
    "num_units": "3",
    "dept_name": "Geographic Information Systems (GIS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "GIS",
    "course_number": "200",
    "course_title": "Interpreting and Creating GIS Maps",
    "course_desc": "This course introduces advanced geospatial analysis techniques, including Global Positioning Systems (GPS), Geographic Information Systems (GIS) database and overlay creation, data classification, location analysis, distribution and density, geovisualization techniques, and map interpretation through the use and application of GIS. This course will combine an overview of general principles of GIS and practical experience in the analytical use of spatial information. Students will gain greater in-depth knowledge of geospatial analysis and examine the social context of mapping and knowledge production, examine the diverse range of GIS applications, and complete a final project with a practical component involving the use of a geospatial analysis software package. Special emphasis and concentration will focus on sustainability, considering the current and future use and protection of resources in light of land management.",
    "num_units": "3",
    "dept_name": "Geographic Information Systems (GIS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in GIS 189."
  },
  {
    "course_prefix": "GIS",
    "course_number": "205",
    "course_title": "GIS Database Design and Programming",
    "course_desc": "This course will cover advanced compilation, database design, and production of maps, including the use of Global Positioning Systems (GPS), Geographic Information Systems (GIS), data export-to-CAD, research, presentations, and illustration using ArcGIS mapping software. Special emphasis and concentration will focus on sustainability, considering the current and future use and protection of resources in light of land management. Class includes a required lab.",
    "num_units": "3",
    "dept_name": "Geographic Information Systems (GIS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in GIS 189 and GIS 200."
  },
  {
    "course_prefix": "GIS",
    "course_number": "213",
    "course_title": "Advanced Geospatial Techniques",
    "course_desc": "This course covers the applications of advanced Geographic Information Systems (GIS) technologies to various problems or issues in the social, natural, and environmental sciences. Remote sensing techniques, radar, and satellite imagery map design will be introduced along with an overview of current advances in geospatial technology, including 3D mapping, online, and cloud mapping.",
    "num_units": "3",
    "dept_name": "Geographic Information Systems (GIS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in GIS 205 and GIS 205L."
  },
  {
    "course_prefix": "GIS",
    "course_number": "214",
    "course_title": "Practicum in GIS",
    "course_desc": "This course is a practicum that will assist students entering the Geographic Information Systems (GIS) job market through internship opportunities in applied geography under professional and faculty supervision. Field placement is integrated with academic study.",
    "num_units": "3",
    "dept_name": "Geographic Information Systems (GIS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in GIS 205 and GIS 205L.; Comments: May be repeated for a maximum of 6 credits."
  },
  {
    "course_prefix": "HAW",
    "course_number": "101",
    "course_title": "Elementary Hawaiian I",
    "course_desc": "This course is an introduction to the basic structures of the Hawaiian language emphasizing listening, speaking, reading, writing, and cultural understanding.",
    "num_units": "4",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 2 lecture/lab; Semester Offered: Fall; Comments: The laboratory is part of the class."
  },
  {
    "course_prefix": "HAW",
    "course_number": "102",
    "course_title": "Elementary Hawaiian II",
    "course_desc": "This course is the second half of the elementary Hawaiian that teaches basic listening, speaking, reading, writing, and cultural understanding.",
    "num_units": "4",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 2 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in HAW 101.; Comments: The laboratory is part of the class."
  },
  {
    "course_prefix": "HAW",
    "course_number": "201",
    "course_title": "Intermediate Hawaiian I",
    "course_desc": "This course is a continuation of HAW 102, focusing on further development of the five recognized skills of language acquisition: listening, speaking, reading, writing, and cultural understanding in the Hawaiian language. Students will gain these five skills, attaining the Intermediate Low level of the ACTFL proficiency scale.",
    "num_units": "4",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in HAW 102."
  },
  {
    "course_prefix": "HAW",
    "course_number": "202",
    "course_title": "Intermediate Hawaiian II",
    "course_desc": "HAW 202 is a continuation of HAW 201 for further development of the five recognized skills of language acquisition: listening, speaking, reading, writing, and cultural understanding in the Hawaiian language. Students will gain the five skills, attaining the Intermediate Mid level on the ACTFL proficiency scale.",
    "num_units": "4",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in HAW 201."
  },
  {
    "course_prefix": "HAW",
    "course_number": "221",
    "course_title": "Introduction to Hawaiian Conversation",
    "course_desc": "This course emphasizes vocabulary development for greater accuracy, more mature expressions, and fluency of conversational Hawaiian language.",
    "num_units": "3",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in HAW 202."
  },
  {
    "course_prefix": "HAW",
    "course_number": "222",
    "course_title": "Introduction to Hawaiian Composition",
    "course_desc": "This class provides systematic practice for control of written Hawaiian. A variety of situations will be introduced in which the student will use written Hawaiian as the medium of communication, providing for further development of vocabulary and grammatical elements for accurate, mature expression.",
    "num_units": "3",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in HAW 202."
  },
  {
    "course_prefix": "HAW",
    "course_number": "261",
    "course_title": "Hawaiian Literature in English",
    "course_desc": "This course is a survey of traditional Hawaiian narratives and poetry. The emphasis will be on the various modes of native Hawaiian literature from pre-contact to the present. Readings will be presented in English translation, with selected Hawaiian texts provided upon request.",
    "num_units": "3",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HAW",
    "course_number": "262",
    "course_title": "Hawaiian Literature in Translation: 1800 to Present",
    "course_desc": "This course offers a sampling of different styles and modes of native Hawaiian literature, primarily from the 19th and 20th centuries. The readings are presented in the original Hawaiian language.",
    "num_units": "3",
    "dept_name": "Hawaiian (HAW)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in HAW 202."
  },
  {
    "course_prefix": "HDFS",
    "course_number": "230",
    "course_title": "Human Devlopment",
    "course_desc": "This course explores the concepts, issues and theories of human growth and development from conception to death. It explores systems approaches to inquiry into factors affecting growth and development.",
    "num_units": "3",
    "dept_name": "Human Development and Family Studies (HDFS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100 or approval of instructor."
  },
  {
    "course_prefix": "HIST",
    "course_number": "151",
    "course_title": "World History to 1500",
    "course_desc": "A global and historical survey focusing on human societies and cross-cultural interactions to 1500 C.E., History 151 is the first half of a two-semester series of courses that cover human history from our origins through the twentieth century. This course provides a survey of world history from the prehistoric era to 1500 C.E. with an emphasis on the development of complex societies and enduring historical trends.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HIST",
    "course_number": "152",
    "course_title": "World History Since 1500",
    "course_desc": "A global and historical survey focusing on human societies and cross-cultural interactions since 1500 C.E., History 152 is the second half of a two-semester series of courses that cover human history from our origins through the twentieth century. This course provides a survey of world history since 1500 C.E. with an emphasis on the growth of and response to global empires, as well as the major revolutions which characterize the modern world.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HIST",
    "course_number": "241",
    "course_title": "Civilizations of Asia I",
    "course_desc": "This is the first in a two-semester series of courses that provide a survey of the history of East, Southeast, and South Asia from the earliest times to the modern era. History 241 will examine the history of Asia from the prehistoric era through 1500 CE. It includes a broad survey of major historical figures, events, and developments in India, China, Korea, and Japan. Students will examine a number of interrelated processes--the origins of civilizations, the formation and disintegration of great empires, the evolution of ruling classes, the growth and spread of religions, as well as nomadic-sedentary relations.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HIST",
    "course_number": "242",
    "course_title": "Civilizations of Asia II",
    "course_desc": "The second in a two-semester series of courses that provide a survey of the history of East, Southeast, and South Asia from the earliest times to the modern era. History 242 will examine the history of Asia from the year 1500 through the present. It includes a broad survey of major historical figures, events, and developments in India, China, Korea, and Japan. Students will examine a number of interrelated processes: technological change, the impact of Western imperialism, the growth of Asian nationalism, and the transition to a modern world.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HIST",
    "course_number": "250",
    "course_title": "Film and World History Since WWII",
    "course_desc": "This course examines historical events, from WWII until the present, through cinema. In this course students will learn how to use films as a historical source, as well as how world events and culture have shaped the direction of cinema.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (once every 3 semesters); Comments: Cross-listed with ART 250."
  },
  {
    "course_prefix": "HIST",
    "course_number": "281",
    "course_title": "Introduction to American History I",
    "course_desc": "This course is a survey of American history from the Paleolithic era through the Civil War, focusing on social history - seeking to tell the story of America \"from the bottom up.\" Students will examine major events, trends and themes in the American past from multiple perspectives and will produce a piece of original research on the early American world.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall (every even year), Spring (every even year); Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HIST",
    "course_number": "282",
    "course_title": "Introduction to American History II",
    "course_desc": "This course provides an introduction to American history after the Civil War. Students will examine major events, trends, and themes in the American past from multiple perspectives and will produce a piece of original research on modern American history.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall (every odd year), Spring (every odd year); Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HIST",
    "course_number": "284",
    "course_title": "History of the Hawaiian Islands",
    "course_desc": "This is a survey course on the history of Hawai‘i from the late prehistoric period to the overthrow of the Hawaiian Kingdom.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HIST",
    "course_number": "288",
    "course_title": "Survey of Pacific Islands History",
    "course_desc": "This course offers a survey of the major events, themes, and issues that make up diverse histories of the Pacific Islands region including Hawai‘i, meanwhile exploring the frequent intersections between Pacific Islander and Native Hawaiian histories and historiographies. We will begin by considering island geographies, indigenous origins and origin stories, and various theories about the settlement of the islands. We will go on to explore the indigenous, early European contact, colonial, and contemporary periods with a focus on indigenous Pacific Islander and Native Hawaiian experiences, interpretations, and historical agency. Throughout the term, we will consider themes such as indigenous historiography, inidigeneity, cultural encounter and change, comparative colonialisms, resistance, global conflict, land and sovereignty, urbanization, migration, climate change, and contemporary neocolonial challenges---with each offering important insights into the histories and cultures of the region.",
    "num_units": "3",
    "dept_name": "History (HIST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall (every even year); Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HLTH",
    "course_number": "140",
    "course_title": "Introduction to Human Body Systems and Related Medical Terminology",
    "course_desc": "This course provides students with an introduction to medical terminology related to human body systems. Students will gain a basic understanding of how medical terms are formed, defined, pronounced and interpreted in the medical field. Normal human anatomy, function, and pathology as well as related medical tests and procedures will also be explored.",
    "num_units": "3",
    "dept_name": "Health (HLTH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HOST",
    "course_number": "100",
    "course_title": "Career and Customer Service Skills",
    "course_desc": "This course builds and maintains the critical skills and understanding necessary to be a dynamic and successful member of today’s rapidly growing service industry. Individuals who work with customers will gain insight into customer behavior and attitudes. Students will develop strategies and skills necessary to create positive relationships encountered in various career situations.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HOST",
    "course_number": "101",
    "course_title": "Introduction to Hospitality and Tourism",
    "course_desc": "This course provides an overview of the travel industry and related major business components. Students will analyze the links between travel, lodging, food, recreation, and other tourism-related industries.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HOST",
    "course_number": "150",
    "course_title": "Housekeeping Operations",
    "course_desc": "This course studies the professional management of housekeeping operations including practical applications and management skills required to ensure quality service and effective performance.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HOST",
    "course_number": "152",
    "course_title": "Front Office Operations",
    "course_desc": "This course studies the philosophy, theory, and current operating procedures of a hotel front office. It concentrates on the human relations skills necessary for effective guest and employee relations, and the technical skills necessary to operate a manual, mechanical, or computerized front office operation.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HOST",
    "course_number": "154",
    "course_title": "Food and Beverage Operations",
    "course_desc": "This course introduces the basic principles of marketing, menu planning, service styles, nutrition, sanitation and safety, purchasing, and control systems as they apply to food and beverage management in an operational setting. The course provides practical applications to effectively manage resources for food and beverage industry operations.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HOST",
    "course_number": "280",
    "course_title": "Hospitality Management",
    "course_desc": "This course examines the key principles and processes of management in the hospitality industry that are essential for organizational effectiveness. The course focuses on leadership skill building, decision-making processes, and human relations management.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in HOST 101.; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HOST",
    "course_number": "293",
    "course_title": "Hospitality and Tourism Internship",
    "course_desc": "This is a supervised field experience that is related to the student's major or career goals. The experience will enable the student to apply knowledge and skills learned in coursework to the work environment.",
    "num_units": "3",
    "dept_name": "Hospitality and Tourism (HOST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 credits = 225 hours of work experience; Semester Offered: Fall, Spring; Prerequisites: Hospitality and Tourism or Culinary Arts major. Department approval. Approval of instructor. \"C\" or higher in HOST 101.; Comments: Prior Learning Assessment credit available for this course."
  },
  {
    "course_prefix": "HPER",
    "course_number": "133",
    "course_title": "Pickleball",
    "course_desc": "This course is a beginning pickleball class, which is a court game that combines skills from tennis, ping pong, and badminton. Throughout this class we will focus on developing basic skills and implementing them into game situations. We will cover skills such as ball control, drive/lob serve, forehand and backhand drive, dink, volley, drop shot, lob, smash, and game strategy.",
    "num_units": "1",
    "dept_name": "Health, Physical Education, and Recreation (HPER)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HPER",
    "course_number": "152",
    "course_title": "Weight Training",
    "course_desc": "This course introduces the student to principles of weight training, understanding the muscles used in exercises, the benefits of training, and the application of proper lifting mechanics. Workouts will be given by the instructor with an emphasis on conditioning, experiencing different types of training, and developing one's own personal lifting program, which will be implemented towards the end of the course.",
    "num_units": "1",
    "dept_name": "Health, Physical Education, and Recreation (HPER)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HPER",
    "course_number": "154",
    "course_title": "Intermediate Weight Training",
    "course_desc": "This course is designed to help students identify and understand the benefits of weight training, how weight training affects the body, and learn intermediate level training routines for complete muscular development. Students will also learn how to design and develop a balanced weight training program to meet their needs and expands on skills learned in HPER 152: Weight Training.",
    "num_units": "2",
    "dept_name": "Health, Physical Education, and Recreation (HPER)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in HPER 152."
  },
  {
    "course_prefix": "HPER",
    "course_number": "170",
    "course_title": "Beginning Yoga",
    "course_desc": "This course will focus on the practice of hatha yoga. General philosophy, history, and benefits toward wellness will be included. The primary emphasis will be on the performance of postures and breathing exercises, along with emphasis on ethical principles, personal conduct, and meditation in order to improve overall wellness.",
    "num_units": "2",
    "dept_name": "Health, Physical Education, and Recreation (HPER)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HPER",
    "course_number": "199",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "1",
    "dept_name": "Health, Physical Education, and Recreation (HPER)",
    "inst_ipeds": 141802,
    "metadata": "Comments: May be repeated any number of times for credit."
  },
  {
    "course_prefix": "HWST",
    "course_number": "107",
    "course_title": "Hawai‘i: Center of the Pacific",
    "course_desc": "This course is an introduction to the unique aspects of Hawai‘i and Hawaiian culture in relation to the larger Pacific including origins, language, religion, land, art, history, and current issues.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100S."
  },
  {
    "course_prefix": "HWST",
    "course_number": "110",
    "course_title": "Huakaʻi Waʻa: Introduction to Hawaiian Voyaging",
    "course_desc": "This course will introduce students to modern Hawaiian canoe voyaging through an examination of the science and narratives of ancient voyaging, the history of the modern revival of voyaging, and the Hawaiian navigator’s toolkit.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HWST",
    "course_number": "111",
    "course_title": "The Hawaiian ‘Ohana",
    "course_desc": "This course presents Hawaiian values through the traditional family system. Ancestral family practices will be investigated and compared with current Hawaiian lifestyles and values.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HWST",
    "course_number": "128",
    "course_title": "Introduction to Hula Kahiko",
    "course_desc": "This course is an introduction to hula and oli (chant) covering the fundamentals of traditional dance and practices, language, and regional traditions.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HWST",
    "course_number": "129",
    "course_title": "Introduction to Hula ‘Auana",
    "course_desc": "This course is an introduction to hula ‘auana covering the fundamentals of contemporary Hawaiian dance, music, practices, language, poetry, and regional traditions.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HWST",
    "course_number": "140",
    "course_title": "Mahi‘ai I - Hawaiian Cultivation Practices",
    "course_desc": "For the past 2,000 years taro, or kalo, has been the main staple and most important food of the Hawaiian people. It has also played a very important role in the beliefs and daily lives of Hawaiians. This course will study the cultural link between the Hawaiians and kalo through the study of traditional cultivation, maintenance, and processing methods used by the Hawaiians. This will occur in conjunction with hands-on experience.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100. \"C\" or higher in HWST 107."
  },
  {
    "course_prefix": "HWST",
    "course_number": "141",
    "course_title": "Mahi‘ai II: Hawaiian Cultivation Practices",
    "course_desc": "This is an intermediate-level course that will continue the study of the cultural link between the Hawaiians and kalo, with more in-depth and hands-on methods of cultivation practices, traditional food preparation, and lo‘i management issues and care.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in HWST 140."
  },
  {
    "course_prefix": "HWST",
    "course_number": "177",
    "course_title": "Hawaiian Music in Transition",
    "course_desc": "This course studies musical traditions in Hawai‘i from pre-contact to the present. It includes indigenous Hawaiian music, its acculturated forms and contemporary trends, and non-Hawaiian music in Hawai‘i. Students will consider aspects of musical style, instruments used, composition, teaching and performance practice, the role of music in society, and repertoire. No musical background is necessary.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "HWST",
    "course_number": "199",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100S.; Comments: Cross-listed with BOT 105."
  },
  {
    "course_prefix": "HWST",
    "course_number": "207",
    "course_title": "Hawaiian Perspectives in Ahupua‘a Resource Management",
    "course_desc": "This course is an examination of the ahupua‘a system as it was conceptualized by the ancient Hawaiians, and an exploration of its relevance in modern society. This course will emphasize ‘Āina based learning.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in HWST 107."
  },
  {
    "course_prefix": "HWST",
    "course_number": "211",
    "course_title": "Ethnobotany",
    "course_desc": "The course focuses on the importance of plants and their influence upon the cultures of Hawai‘i and the Pacific. Students learn traditional and contemporary use of cultivated and wild plants.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Comments: Cross-listed with BOT 105."
  },
  {
    "course_prefix": "HWST",
    "course_number": "213",
    "course_title": "Hawaiian Ethnozoology",
    "course_desc": "This course studies Hawaiian fishes, birds, and other creatures--their identification and habitat and their place in the heritage of the Hawaiian people, methods of capture, conservation techniques, and practical uses. Hawaiian and biological terminology will be used.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Comments: Cross-listed with ZOOL 105."
  },
  {
    "course_prefix": "HWST",
    "course_number": "228",
    "course_title": "Hula Kahiko",
    "course_desc": "Students refine and enhance the skills learned in HWST 128.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in HWST 128 or approval of instructor."
  },
  {
    "course_prefix": "HWST",
    "course_number": "229",
    "course_title": "Hula ʻAuana",
    "course_desc": "Students will refine and enhance the skills learned in HWST 129.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in HWST 129."
  },
  {
    "course_prefix": "HWST",
    "course_number": "270",
    "course_title": "Hawaiian Mythology",
    "course_desc": "HWST 270 is an introduction to Hawaiian mythology and mo‘olelo as a basis of understanding (or a reflection) of Hawaiian culture, values, metaphor, and worldviews. This course will investigate and analyze oral and written Hawaiian literary sources and the roles of akua, ‘aumakua, kupua and kanaka.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in either HAW 101 or HWST 107."
  },
  {
    "course_prefix": "HWST",
    "course_number": "281",
    "course_title": "Hoʻokele I : Hawaiian Astronomy and Weather",
    "course_desc": "This course is a survey of the Hawaiian and Polynesian environment in relationship to migration, voyaging, and folklore. This course will provide the student with the basics of wayfinding (or non-instrument) techniques as utilized by the voyages of Hokule‘a, Hawai‘i Loa, Makali‘i, and other Polynesian voyaging canoes. In addition, the class will explore and appreciate the cultural impact of long distance voyaging and the settlement of Polynesia upon contemporary society.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100S. Qualified for MATH 82X or \"C\" or higher or concurrent enrollment in MATH 75X."
  },
  {
    "course_prefix": "HWST",
    "course_number": "282",
    "course_title": "Hoʻokele II: Hawaiian Navigation",
    "course_desc": "This course will introduce students to the skills of Polynesian navigation and seamanship through the exploration and experiences of the voyages of contemporary Polynesian voyaging canoes. In addition, students will have opportunities to learn and practice some of these skills on a double-hulled sailing canoe.",
    "num_units": "4",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 2 lecture/lab; Semester Offered: Fall, Spring (every even year); Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "HWST",
    "course_number": "290",
    "course_title": "Rediscovering Polynesian Connections",
    "course_desc": "This course investigates Polynesian connections through life experiences. This is a study abroad course in which the student will experience the interconnectedness of the peoples and cultures of Polynesia, other Pacific nations, or other nations throughout the world through cultural immersion. Studies will begin on the home campus and culminate with a visit to the host country.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer; Prerequisites: Approval of instructor."
  },
  {
    "course_prefix": "HWST",
    "course_number": "299",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "3",
    "dept_name": "Hawaiian Studies (HWST)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100S.; Comments: Cross-listed with BOT 105."
  },
  {
    "course_prefix": "ICS",
    "course_number": "101",
    "course_title": "Digital Tools for the Information World",
    "course_desc": "This course covers fundamental information technology concepts and computing terminology, productivity software for problem solving, computer technology trends, and impact on individuals and society. Emphasis will be placed on the utilization of operating systems and the production of professional documents, spreadsheets, presentations, databases, and web pages.",
    "num_units": "3",
    "dept_name": "Information and Computer Sciences (ICS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "ICS",
    "course_number": "111",
    "course_title": "Introduction to Computer Science I",
    "course_desc": "This course is intended for Computer Science majors and all others interested in the first course in programming. This course is an overview of the fundamentals of computer science emphasizing problem solving, algorithm development, implementation, and debugging/testing using an object-oriented programming language.",
    "num_units": "3",
    "dept_name": "Information and Computer Sciences (ICS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 103."
  },
  {
    "course_prefix": "IS",
    "course_number": "50",
    "course_title": "Summer Bridge",
    "course_desc": "IS 50: Summer Bridge is meant to help prepare students for their first semester at KCC. This course\n                includes the study of resources available to students at KCC, college-level study skills, non-cognitive\n                affective success skills, and the use of technology to create, manage, and share files.",
    "num_units": "2",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Summer"
  },
  {
    "course_prefix": "IS",
    "course_number": "103",
    "course_title": "Introduction to College",
    "course_desc": "This course is a comprehensive first-year experience course for new students. This course takes a place-based approach, in which students are encouraged to explore connections between their personal and cultural identity, their community, and the college. Students will learn about college resources, study skills, and psycho-social skills that contribute to college success.",
    "num_units": "3",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "IS",
    "course_number": "105",
    "course_title": "Career/Life Exploration and Planning",
    "course_desc": "The course provides opportunities and resources for students to seek career information related to academic and occupational interest patterns, which form the foundation for sound career decision-making. Students are guided through individual and group exercises that assist in identifying needs, values, wants, interests, and abilities. The purpose of the course is to help students develop a strong foundation for major and career decision planning through career inventories, research on careers, and personal reflections.Framework: This course uses the Pyramid of Information-Processing (Knowing about myself & knowing about my options→Knowing how I make decisions→Thinking about my decision making) and the CASVE Cycle (→Communication→Analysis→ Synthesis→Valuing→Execution→) as a framework for career and major exploration.",
    "num_units": "3",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "IS",
    "course_number": "110",
    "course_title": "Foundations of College Success",
    "course_desc": "This course is designed to assist students in the transition to college. In this course you will learn proven strategies for creating greater academic, professional, and personal success. Major topics include study techniques, campus resources, and the development of attitudes, values, and beliefs that foster success.",
    "num_units": "1",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "IS",
    "course_number": "111",
    "course_title": "Career Planning and Financial Literacy",
    "course_desc": "This course will introduce students to the process of career exploration and enhance students' knowledge and skills regarding personal finance to increase financial literacy. Students will assess their own abilities, interests, and values, and then apply this self-knowledge in their choice of major and career. Students will learn the financial planning process and evaluate their money management attitudes and behaviors.",
    "num_units": "1",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Spring"
  },
  {
    "course_prefix": "IS",
    "course_number": "180",
    "course_title": "Study Abroad",
    "course_desc": "This course is a place holder course for students who study abroad on an exchange program for a semester or for an entire academic year. Students going on the exchange program will register for this course (1-15 credits) and pay only their home campus' tuition. Upon returning to Kaua‘i CC, students are responsible for submitting the course syllabi and transcripts from the host institution to the admissions office for the courses taken abroad to be articulated with courses offered by UH. After the courses are articulated, students will receive equivalent UH credit for the courses taken abroad while this course will remain on the transcript but will show zero credit.",
    "num_units": "1",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: Instructional hours will vary according to courses taken at the host institution.; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor."
  },
  {
    "course_prefix": "IS",
    "course_number": "201",
    "course_title": "Interdisciplinary Studies: Ahupuaʻa Field Study",
    "course_desc": "Students will explore traditional Hawaiian land management and food production systems through hands-on fieldwork, applying traditional knowledge to modern environmental challenges, developing leadership skills, and connecting with the land.",
    "num_units": "3",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture and 3 lab; Semester Offered: Fall, Spring; Prerequisites: Approval of instructors."
  },
  {
    "course_prefix": "IS",
    "course_number": "295",
    "course_title": "Ahupuaʻa Research Experience",
    "course_desc": "This course offers students an in-depth exploration of intermediate-level practices and principles related to ʻāina (land) field research, focusing on environmental and cultural dimensions, project management, leadership, and historical context. Building on foundational knowledge, students will engage in hands-on fieldwork and community-based projects that emphasize the application of traditional and contemporary Hawaiian land and water management systems.",
    "num_units": "3",
    "dept_name": "Interdisciplinary Studies (IS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 9 lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in IS 201."
  },
  {
    "course_prefix": "JPN",
    "course_number": "101",
    "course_title": "Elementary Japanese I",
    "course_desc": "This course is an introduction to the Japanese language emphasizing conversation, listening, grammar, reading, and writing.",
    "num_units": "4",
    "dept_name": "Japanese Language and Literature (JPN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "JPN",
    "course_number": "102",
    "course_title": "Elementary Japanese II",
    "course_desc": "This is the second semester of an elementary course in spoken and written Japanese. As a first-year course, it emphasizes the spoken language, but increasing attention is given to reading and writing. Students are expected to have an active knowledge of both Hiragana and Katakana.",
    "num_units": "4",
    "dept_name": "Japanese Language and Literature (JPN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in JPN 101 or placement test score demonstrating equivalent knowledge and skills."
  },
  {
    "course_prefix": "JPN",
    "course_number": "201",
    "course_title": "Intermediate Japanese I",
    "course_desc": "This is the first half of an intermediate course in spoken and written Japanese. As a second-year course, it emphasizes reading and writing. Students are expected to have an active knowledge of Hiragana, Katakana, and approximately 150 Kanji characters.",
    "num_units": "4",
    "dept_name": "Japanese Language and Literature (JPN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in JPN 102 or placement test score demonstrating equivalent knowledge and skills."
  },
  {
    "course_prefix": "JPN",
    "course_number": "202",
    "course_title": "Intermediate Japanese II",
    "course_desc": "This is the second semester of an intermediate course in spoken and written Japanese.",
    "num_units": "4",
    "dept_name": "Japanese Language and Literature (JPN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in JPN 201 or placement test score demonstrating equivalent knowledge and skills.; Comments: The laboratory is part of the class."
  },
  {
    "course_prefix": "MARE",
    "course_number": "171",
    "course_title": "Introduction to Marine Biology I",
    "course_desc": "MARE 171, Introduction to Marine Biology I, is an introductory biology course with a marine emphasis for all life science majors. Cell structure and chemistry; growth, reproduction, genetics, evolution, viruses, bacteria, and simple eukaryotes. It is taught with a molecular and cellular biology focus.",
    "num_units": "3",
    "dept_name": "Marine Science (MARE)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Comments: Cross-listed with BIOL 171."
  },
  {
    "course_prefix": "MARE",
    "course_number": "172",
    "course_title": "Introduction to Marine Biology II",
    "course_desc": "BIOL/MARE 172 is a continuation of BIOL/MARE 171 emphasizing anatomy, physiology, and systematic of plants and animals to include behavior, ecosystems, populations, and communities.",
    "num_units": "3",
    "dept_name": "Marine Science (MARE)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in MARE 171 and MARE 171L.; Comments: Cross-listed with BIOL 172."
  },
  {
    "course_prefix": "MATH",
    "course_number": "16",
    "course_title": "Math Study Skills",
    "course_desc": "Students in MATH 16 study and apply essential study skills needed to succeed in mathematics and other mathematics-related courses. Techniques are introduced to reduce math anxiety, improve note-taking skills, manage time effectively, employ effective study techniques, and practice sound math test-taking skills.",
    "num_units": "1",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall, Spring; Comments: This course is credit (C) or no credit (NC)."
  },
  {
    "course_prefix": "MATH",
    "course_number": "75",
    "course_title": "Introduction to Mathematical Reasoning",
    "course_desc": "This course prepares students for MATH 100, MATH 111, and MATH 115. Course topics include ratio and percent, unit conversion, graphs, data interpretation, basic algebra, solving linear equations, and working with formulas with special emphasis on pattern recognition and problem solving. This course will emphasize the importance of a growth mindset and number sense.",
    "num_units": "4",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MATH",
    "course_number": "82",
    "course_title": "Expanded Algebraic Foundations",
    "course_desc": "This covers elementary algebra topics. Topics include linear equations and inequalities, graphing, linear\n                systems, properties of exponents, operations on polynomials, factoring, rational and radical expressions\n                and equations, quadratic equations, and applications. Additional topics may include graphing by\n                transformation, introduction to logarithms and functions, and dimensional analysis.",
    "num_units": "5",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 5 lecture; Semester Offered: Fall, Spring; Prerequisites: Appropriate math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "88",
    "course_title": "College Algebra Companion",
    "course_desc": "MATH 88 provides students with supplemental algebra instruction that directly supports the topics covered in MATH 103.",
    "num_units": "2",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Fall, Spring; Prerequisites: Appropriate math placement.; Comments: This course is credit (C) or no credit (NC)."
  },
  {
    "course_prefix": "MATH",
    "course_number": "100",
    "course_title": "Survey of Mathematics",
    "course_desc": "This course is designed to acquaint non-science majors with mathematical reasoning and problem solving, and to expose students to the power and utility of mathematics through its relationship to the world. Foundational topics covered are problem solving and elementary logic; additional topics may include one or more of the following areas: geometry, probability, statistics, voting methods, financial math, numeration systems, and counting theory.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MATH 75X or MATH 82X; or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "103",
    "course_title": "College Algebra",
    "course_desc": "MATH 103 is a continuation from Elementary Algebra. Topics of study include exponents; algebraic equations and inequalities; absolute value; polynomial, rational, radical, exponential and logarithmic functions; circles; and systems of equations and inequalities.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MATH 82X or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "111",
    "course_title": "Math for Elementary Teachers I",
    "course_desc": "This course teaches students to communicate and represent mathematical ideas, how to solve problems, and how to reason mathematically. Material covered includes operations and their properties, sets, counting, patterns, and algebra.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100. \"C\" or higher in MATH 75X or MATH 82X; or acceptable math placement.; Comments: This course is intended for prospective elementary education majors only."
  },
  {
    "course_prefix": "MATH",
    "course_number": "112",
    "course_title": "Math for Elementary Teachers II",
    "course_desc": "This course deals with representations of and operations on the natural numbers, integers, rational numbers, and real numbers. It also explores properties of those operations.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in MATH 111.; Comments: This course is intended for prospective elementary education majors only."
  },
  {
    "course_prefix": "MATH",
    "course_number": "115",
    "course_title": "Introduction to Statistics and Probability",
    "course_desc": "This course utilizes basic statistical topics including measures of central tendency and dispersion, classification of variables, sampling techniques, elementary probability, normal and binomial probability distributions, tests of hypothesis, linear regression and correlation in order to solve problems.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MATH 75X or MATH 82X; or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "135",
    "course_title": "Pre-Calculus: Elementary Functions",
    "course_desc": "Students in this course study the operations with, the inverse of, and the multiple representations of functions, including but not limited to linear; quadratic; polynomial; rational; exponential; and logarithmic. Appropriate use of technology is incorporated to enhance the conceptual understanding of mathematics. This course is recommended to students who are pursuing further studies in business, engineering, mathematics and/or sciences.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MATH 103 or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "140",
    "course_title": "Pre-Calculus: Trigonometry and Analytic Geometry",
    "course_desc": "The second part of the Pre-Calculus sequence, this course includes a study of trigonometry, analytic geometry and applications.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MATH 135 or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "241",
    "course_title": "Calculus I",
    "course_desc": "This course focuses on limits and continuity, techniques and applications of differentiation of algebraic and trigonometric functions, and an introduction to integration.",
    "num_units": "4",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in MATH 140X or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "242",
    "course_title": "Calculus II",
    "course_desc": "This course offers the opportunity to study integral calculus, transcendental functions, and series representation of functions. Applications include finding the balancing point of an object, computing the force on submerged objects, and modeling population growth, radioactive decay, and the temperature of a heating or cooling object.",
    "num_units": "4",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in MATH 241 or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "243",
    "course_title": "Calculus III",
    "course_desc": "This course covers vector algebra, vector-valued functions, differentiation of functions of several variables, and optimization.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in MATH 242 or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "244",
    "course_title": "Calculus IV",
    "course_desc": "This course covers multiple integrals; line integrals and Green's Theorem; surface integrals; and Stokes's and Gauss's Theorems.",
    "num_units": "3",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in MATH 243 or acceptable math placement."
  },
  {
    "course_prefix": "MATH",
    "course_number": "245",
    "course_title": "Multivariable Calculus",
    "course_desc": "This course covers multivariable differential and integral calculus, including vector-valued functions, optimization, multiple integrals, and theorems on integration in vector fields.",
    "num_units": "4",
    "dept_name": "Mathematics (MATH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MATH 242 or acceptable math placement."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "105",
    "course_title": "Introduction to Medical Assisting",
    "course_desc": "This course provides an introduction to medical assisting. The course focuses on the concepts of effective communication and protective practices related to health and safety to prevent illness and injury. Basic nutritional concepts and therapeutic diets will also be discussed.",
    "num_units": "3",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Admission into the Medical Assisting program."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "120",
    "course_title": "Clinical Medical Assisting I",
    "course_desc": "This course introduces the basic clinical skills and procedures required to function as a medical assistant. Topics include integrated clinical procedures, and assisting with specialty exams and procedures.",
    "num_units": "2",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Fall; Prerequisites: Admission into the Medical Assisting program."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "123",
    "course_title": "Clinical Medical Assisting II",
    "course_desc": "This course introduces basic specimen collection techniques including the preparation and examination of samples for diagnostic purposes. Advanced techniques and procedures for specialty examinations in the ambulatory care setting will also be included.",
    "num_units": "2",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in MEDA 120 and MEDA 176."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "143",
    "course_title": "Administrative Medical Assisting I",
    "course_desc": "This course introduces basic concepts of administrative medical assisting including client scheduling, medical office financial practices, and medical insurance. Communication and confidentiality in relation to administrative duties will also be discussed.",
    "num_units": "2",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Fall; Prerequisites: Admission into the Medical Assisting program."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "150",
    "course_title": "Medical Assisting Science",
    "course_desc": "This course covers basic concepts of human anatomy and physiology, characteristics of disease processes, etiology, treatment methods, and pathophysiology of selected diseases from major body systems including related medical terminology. The application of disease related principles to the function of Medical Assisting practice will also be discussed.",
    "num_units": "4",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall; Prerequisites: Admission into the Medical Assisting program. Approval of instructor."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "165",
    "course_title": "Administrative Medical Assisting II",
    "course_desc": "This course focuses on the concepts of administrative medical assisting including medical office procedural and diagnostic coding, billing, insurance claims processes, and medical office management.",
    "num_units": "2",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in MEDA 143."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "176",
    "course_title": "Administration of Medications",
    "course_desc": "This course will provide an introduction to basic pharmacology and medication administration. Students will learn the basic classification of medications, administration techniques and use applied mathematics to safely prepare and administer medications in a medical office setting.",
    "num_units": "2",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Fall; Prerequisites: Admission into the Medical Assisting program."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "201",
    "course_title": "Medical Law and Ethics",
    "course_desc": "This course focuses on legal and ethical responsibilities in patient care and management: laws pertaining to medical practice and medical assistants, application of medical ethics in performance of duties.",
    "num_units": "2",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in MEDA 105, MEDA 143, and MEDA 150."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "205",
    "course_title": "Medical Assisting Certification Review",
    "course_desc": "This course focuses on reviewing medical assisting concepts in preparation for a medical assistant certification exam. Certification test taking skills and preparation will also be discussed.",
    "num_units": "1",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in MEDA 143, MEDA 120, and MEDA 176 or approval of instructor."
  },
  {
    "course_prefix": "MEDA",
    "course_number": "220",
    "course_title": "Medical Assisting Preceptorship",
    "course_desc": "This course will provide students with supervised clinical experience and the opportunity to integrate medical assisting skills into a real life setting. Clinical experiences will take place in medical offices with an assigned preceptor.",
    "num_units": "4",
    "dept_name": "Medical Assisting (MEDA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 12 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in MEDA 120 and MEDA 176."
  },
  {
    "course_prefix": "MGT",
    "course_number": "120",
    "course_title": "Principles of Management",
    "course_desc": "This course introduces the functions of management from an organizational viewpoint: planning, organizing, directing, and controlling. Contemporary studies that relate to communication, motivation, leadership styles, and decision making will be included.",
    "num_units": "3",
    "dept_name": "Management (MGT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MGT",
    "course_number": "122",
    "course_title": "Organizational Behavior",
    "course_desc": "This course gives students an opportunity to understand and utilize human relations concepts as they apply to the business environment. Areas included are morale, personal efficiency, leadership, personality, motivation, and communication.",
    "num_units": "3",
    "dept_name": "Management (MGT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MGT",
    "course_number": "124",
    "course_title": "Human Resource Management",
    "course_desc": "This course is an introduction to the principles, organizations, and techniques of personnel administration including procurement and placement, improvement of performance, management and labor relations, remuneration and security, and other services provided to the firm by the personnel section. This course is designed to give students an operational knowledge of the activities involved in personnel management relations with regard to their future roles in business.",
    "num_units": "3",
    "dept_name": "Management (MGT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MICR",
    "course_number": "130",
    "course_title": "General Microbiology",
    "course_desc": "This course is an introduction in microbiology with emphasis on the bacteria. The course includes topics in microbial morphology, metabolism, genetics, immunology, and selected topics in applied microbiology and virology. Special topics in microbial and parasitic diseases of man, animal, and plants will be used to illustrate the diversity and complexity of these microorganisms.",
    "num_units": "3",
    "dept_name": "Microbiology (MICR)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for ENG 100. Qualified for MATH 82X."
  },
  {
    "course_prefix": "MICR",
    "course_number": "140",
    "course_title": "General Microbiology Lab",
    "course_desc": "This laboratory course will give practical, hands-on experiences in introductory microbiology. Laboratory exercises are selected to illustrate fundamental principles covered in lecture.",
    "num_units": "2",
    "dept_name": "Microbiology (MICR)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in MICR 130."
  },
  {
    "course_prefix": "MKT",
    "course_number": "120",
    "course_title": "Principles of Marketing",
    "course_desc": "This course is an introduction to marketing concepts and the application to the process of marketing products, services, and ideas to provide value and benefits to both for-profit and non-profit organizations. Students will develop an understanding of the marketing process, analyze marketing opportunities, and develop strategies to fulfill the needs of target markets.",
    "num_units": "3",
    "dept_name": "Marketing (MKT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "MKT",
    "course_number": "130",
    "course_title": "Principles of Retailing",
    "course_desc": "This course provides an introductory view of retailing and its relative position in the marketing chain. The primary emphasis is on the basic functions of a retail store, including finance and control, operations, personnel, merchandising, and sales promotion.",
    "num_units": "3",
    "dept_name": "Marketing (MKT)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall (every odd year), Spring (every odd year)"
  },
  {
    "course_prefix": "MUS",
    "course_number": "121",
    "course_title": "Voice 1",
    "course_desc": "This course of beginning voice instruction emphasizes proper breathing and vocal placement. The primary objective of the course is to free the voice.",
    "num_units": "2",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 2 lecture/lab; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MUS",
    "course_number": "122",
    "course_title": "Voice 2",
    "course_desc": "This course is a continuation of MUS 121B and develops principles of voice production, correct voice placement, breath control, vocal range, diction, dynamics, phrasing, interpretation, and stage presence. Students perform songs of various styles.",
    "num_units": "2",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MUS 121B."
  },
  {
    "course_prefix": "MUS",
    "course_number": "166",
    "course_title": "Popular Music in America",
    "course_desc": "This course is a study of folk, pop, and rock music of the 20th century. Students will look at important composers, styles, and performers in a historical framework. No musical knowledge is required.",
    "num_units": "3",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MUS",
    "course_number": "201",
    "course_title": "Vocal Ensemble",
    "course_desc": "This course is a study and performance of choral literature from Renaissance to the present. It will include a capella and choral/instrumental repertoire.",
    "num_units": "2",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in MUS 122B; or audition and approval of instructor."
  },
  {
    "course_prefix": "MUS",
    "course_number": "202",
    "course_title": "College Band",
    "course_desc": "This course covers the performance of band literature with emphasis on excellence in musical performance and development of professional musicianship. Class members will participate in rehearsals and concerts.",
    "num_units": "1",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated any number of times for credit."
  },
  {
    "course_prefix": "MUS",
    "course_number": "203",
    "course_title": "College Orchestra",
    "course_desc": "This course provides an opportunity for orchestral musicians to perform repertoire ranging from Renaissance and Baroque to contemporary popular music.",
    "num_units": "1",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated any number of times for credit."
  },
  {
    "course_prefix": "MUS",
    "course_number": "204",
    "course_title": "Jazz Ensemble",
    "course_desc": "This course is the performance of stage band literature from swing to contemporary periods. Students will study jazz concepts, including improvisation. Public performances are required.",
    "num_units": "1",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture/lab; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated any number of times for credit."
  },
  {
    "course_prefix": "MUS",
    "course_number": "220",
    "course_title": "Musical Theatre",
    "course_desc": "This course provides students with the opportunity to study vocal and theatrical technique in a musical theatre context.",
    "num_units": "3",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MUS",
    "course_number": "253",
    "course_title": "Elementary Music in Action",
    "course_desc": "This course is an engagement in the practice of the components of music, specifically, time, pitch, media, musical expression, and form, and how these interact with each other to comprise a musical experience. The means through which these components will be explored are singing; using rhythm instruments, playing recorder, ukulele, bells, piano, and other classroom instruments; listening as a primary means of engaging the musical mind; movement as a primary means of engaging the kinesthetic and body senses; performing from notation; notating music; and analyzing music aurally and from score.",
    "num_units": "3",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "MUS",
    "course_number": "254",
    "course_title": "Songwriting and Transcription",
    "course_desc": "The course is divided into three parts, and each part constitutes approximately one-third of the semester. Part I focuses on developing aural skills (recognition and notation of intervals, rhythm, and harmony) and the setting of text and music. Part II is a study of standard song structures, harmonic progressions, and notation with the Sibelius music software. Part III will be devoted to song composition. The student will compose at least four songs and notate them with the Sibelius music software.",
    "num_units": "3",
    "dept_name": "Music (MUS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: “C” or higher in MUS 253."
  },
  {
    "course_prefix": "NURS",
    "course_number": "100",
    "course_title": "Certified Nurse Aide",
    "course_desc": "This course prepares students toward entry-level nurse aide competencies with the ability to provide care to the elderly, ill, and disabled. Topics include personal care, infection control, communication, resident rights, emotional support and care of special populations. After successful completion of NURS 100 and NURS 100L, students are eligible to take the State of Hawai‘i Nurse Aide certification exam.",
    "num_units": "3",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "NURS",
    "course_number": "203",
    "course_title": "General Pharmacology",
    "course_desc": "This course discusses drugs with an emphasis on sites and mechanisms of action, toxicity, fate, and uses of major therapeutic agents.",
    "num_units": "3",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in NURS 210 and NURS 211."
  },
  {
    "course_prefix": "NURS",
    "course_number": "210",
    "course_title": "Health Promotion Across the Lifespan",
    "course_desc": "This course focuses on identifying needs of the total person across the lifespan in a wellness/health promotion model of care. It introduces the roles of the nurse, nursing code of ethics, and the nursing process with emphasis on learning self-health and client health practices. To support self-health and client health practices, students learn to access research evidence about healthy lifestyle patterns and risk factors for disease/illness, apply growth and development theory, interview clients in a culturally sensitive manner, and work as members of a multidisciplinary team utilizing reflective thinking and self-analysis.",
    "num_units": "9",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 18 lab; Semester Offered: Fall; Prerequisites: Admission into the Career Ladder Nursing Program. Approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "211",
    "course_title": "Professionalism in Nursing I",
    "course_desc": "This first level course focuses on the history of nursing practice and education. Ethical and legal aspects as well as professional responsibilities in the practice of nursing are emphasized.  In addition, an introduction to the professional standards of nursing are presented.",
    "num_units": "1",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall; Prerequisites: Admission into the Career Ladder Nursing Program. Approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "212",
    "course_title": "Pathophysiology",
    "course_desc": "This course will introduce students to pathophysiologic concepts which serve as a foundation to understanding the basis of illness and injury and their corresponding spectrum of human response. These concepts will serve as a foundation for the formulation of clinical decisions and care planning.",
    "num_units": "3",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in PHYL 142 and PHYL 142L. Approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "220",
    "course_title": "Health and Illness I",
    "course_desc": "This course provides an opportunity for students to develop their assessment skills and utilize common nursing interventions for clients with illnesses common across the lifespan in communities in Hawai‘i. The client and family's understanding and acceptance of their illness coupled with clinical practice guidelines and evidence-based research are used to guide clinical judgment in nursing care. Roles of the interdisciplinary team and legal aspects of delegation are explored in the context of nursing care. The cultural, ethical health policy, and healthcare delivery system are explored.",
    "num_units": "10",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture and 18 lab; Semester Offered: Spring; Prerequisites: \"C\" or higher in NURS 210 and NURS 211. Approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "230",
    "course_title": "Clinical Immersion I",
    "course_desc": "This course focuses on monitoring a variety of subjective and objective data, identifying obvious patterns and deviations, and developing a prioritized intervention plan for specific populations. In this course, students will implement new nursing skills with supervision, develop their own beginning leadership abilities, and acknowledge delegation as a needed modality to improve client care.",
    "num_units": "4",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 9 lab; Semester Offered: Summer; Prerequisites: “C” or higher in both NURS 203 and NURS 220. Approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "259",
    "course_title": "Basic ECG Interpretation for Health Care Providers",
    "course_desc": "This course develops nursing theory related to the accurate interpretation of cardiac rhythms and arrhythmias on the 12 lead electrocardiogram (ECG). The focus is on the cardiac conduction system, electrophysiology, and a systematic approach to the interpretation and treatment of cardiac rhythms and arrhythmias.",
    "num_units": "2",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 2 lecture; Semester Offered: Spring; Prerequisites: Concurrent enrollment in the Nursing program, licensed Registered Nurse, Emergency Medical Technician, or approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "320",
    "course_title": "Health and Illness II",
    "course_desc": "This course focuses on the nursing care and health promotion for maternal-newborn and pediatric clients and families in the acute care and community settings. Students will learn to utilize family theories and assessment tools when providing culturally sensitive, client-centered care.",
    "num_units": "10",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture and 18 lab; Semester Offered: Fall; Prerequisites: “C” or higher in NURS 230. Approval of instructor."
  },
  {
    "course_prefix": "NURS",
    "course_number": "360",
    "course_title": "Health and Illness III",
    "course_desc": "This course builds on Health and Illness I and II, focusing on more complex and/or unstable patient care situations some of which require strong recognition skills and rapid decision-making. The evidence base supporting appropriate focused assessment and effective, efficient nursing intervention are explored. Lifespan and developmental factors, cultural variables, and legal aspects of care frame the ethical decision-making employed in patient choices for treatment or palliative care within the acute care, psychiatric, and home health settings. Case scenarios incorporate prioritizing care needs, delegation and supervision, family and patient teaching for discharge planning, home health care, and/or end of life care.",
    "num_units": "9",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture and 18 lab; Semester Offered: Spring; Prerequisites: “C” or higher in NURS 320."
  },
  {
    "course_prefix": "NURS",
    "course_number": "362",
    "course_title": "Professionalism in Nursing II",
    "course_desc": "The focus will be on nursing responsibility with regard to current issues in nursing and health care. Included will be the nurse's role as a contributing member of the profession and the community. The theoretical basis for designing and implementing systems of nursing at the beginning level of patient management in an institutional setting will be examined. Principles of organizational structure, leadership, decision-making, priority setting, and change will be discussed.",
    "num_units": "1",
    "dept_name": "Nursing (NURS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in NURS 320."
  },
  {
    "course_prefix": "OCN",
    "course_number": "101",
    "course_title": "Introduction to Marine Option Program",
    "course_desc": "This course provides information to students interested in learning more about organizations and projects related to ocean and freshwater systems. The course will review the requirements of the Marine Option Program (MOP) Certificate and explore opportunities for internships, research projects and careers dealing with water environments. The course will also present guidelines in proposal writing, project implementation, data collection and interpretation, report preparation, and formal project presentation.",
    "num_units": "1",
    "dept_name": "Oceanography (OCN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "OCN",
    "course_number": "120",
    "course_title": "Global Environmental Challenges",
    "course_desc": "This course focuses on scientific approaches to evaluating human-caused environmental challenges and their potential solutions.",
    "num_units": "3",
    "dept_name": "Oceanography (OCN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 100 or concurrent enrollment in MATH 75X."
  },
  {
    "course_prefix": "OCN",
    "course_number": "199",
    "course_title": "Directed Study",
    "course_desc": "Students in this course will practice strategies, methods, and techniques for successful project completion. Students and the instructor will agree on a project before the start of the course. Reading and research in any area of Oceanography under the direction of a faculty member. Students are encouraged to present their findings at the annual University of Hawai‘i system-wide Marine Option Program Student Symposium.",
    "num_units": "1",
    "dept_name": "Oceanography (OCN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 hours (1 credit), 5 hours (2 credits); Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated for a maximum of 50 credits."
  },
  {
    "course_prefix": "OCN",
    "course_number": "201",
    "course_title": "Science of the Sea",
    "course_desc": "This is a survey course of the ocean involving the study of the geological, physical, chemical, and biological properties of the ocean. A number of subjects are studied to include the ocean basin, seawater properties, currents, waves, tides, marine organisms, and the ecological principles of humans and the sea.",
    "num_units": "3",
    "dept_name": "Oceanography (OCN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100 and MATH 82X."
  },
  {
    "course_prefix": "PH",
    "course_number": "201",
    "course_title": "Introduction to Public Health",
    "course_desc": "PH 201, Introduction to Public Health, is intended to give students an overview of the broad field of public health, which centers on health promotion and disease prevention. Throughout the course, students will be actively engaged in discussions and activities that promote a greater understanding of public health as a system, as well as its interdisciplinary connections to other health care fields. Critical thinking and analysis of important public health issues will also be emphasized throughout the semester. This course additionally serves as an introductory course for the Bachelors of Arts degree in Public Health.",
    "num_units": "3",
    "dept_name": "Public Health (PH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "PH",
    "course_number": "202",
    "course_title": "Public Health Issues in Hawaiʻi",
    "course_desc": "This course focuses primarily on application of general public health concepts and tools specifically from the perspective of Kauaʻi and the State of Hawaiʻi. Broader public health issues will also be discussed as they relate to Kauaʻi and State of Hawaiʻi. Students will be exposed to specific challenges and successes in Kauaʻi and Hawaiʻi as they relate to public health. Students will also engage in a series of ethical debates regarding topics of public health interest in Kauaʻi and Hawaiʻi.",
    "num_units": "3",
    "dept_name": "Public Health (PH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in PH 201."
  },
  {
    "course_prefix": "PH",
    "course_number": "203",
    "course_title": "Introduction to Global Health",
    "course_desc": "This introductory course is designed to introduce students to the global parameters of public health and to begin learning how to apply public health principles to issues and challenges in global public health. Students will learn about the strong linkages between health, economic and social development, as well as disparities in health and related socio-economic indicators, challenges to public health faced by wealthier countries, and the role of globalization and its impacts on health. Population-based public health interventions to address this wide array of health challenges will be discussed as well, including the role of community-based efforts in improving public health and the need for interdisciplinary and trans-disciplinary approaches to address global health issues.",
    "num_units": "3",
    "dept_name": "Public Health (PH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in PH 201."
  },
  {
    "course_prefix": "PH",
    "course_number": "210",
    "course_title": "Quantitative Reasoning for Public Health",
    "course_desc": "The purpose of this course is to enable public health students to become better critical thinkers by engaging them as active learners of quantitative analytic methods. Through numerous examples, exercises, and activities featuring public health and other real-world data, students will develop the skills necessary to (1) identify, analyze, and solve real-world problems that involve quantitative information; (2) reason quantitatively and make numerical arguments; (3) interpret and communicate the results of quantitative analyses; (4) use technology and internet resources effectively and build skills in working with data; and (5) develop and improve “numerical intuition” and confidence in the ability to engage in quantitative thinking.",
    "num_units": "3",
    "dept_name": "Public Health (PH)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in MATH 100."
  },
  {
    "course_prefix": "PHIL",
    "course_number": "100",
    "course_title": "Introduction to Philosophy",
    "course_desc": "In this course, students will be introduced to the nature of philosophical inquiry by considering some of the most fundamental questions that can be asked about the nature of reality, human beings and our knowledge of both: Does god exist? Do human beings have free will? What's the essence of personal identity? What does it mean to have knowledge? Can we know anything at all? Do human beings have an obligation to act morally? What makes a particular action moral or immoral?",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "101",
    "course_title": "Introduction to Philosophy: Morals and Society",
    "course_desc": "In this course, students will be introduced to the nature of philosophical inquiry by considering some of the most fundamental and controversial questions in moral philosophy: Do human beings have an obligation to act morally? Where do our moral principles come from? Are there objective moral truths? What makes a particular action moral or immoral?",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "102",
    "course_title": "Introduction to Philosophy: Asian Traditions",
    "course_desc": "This course will explore issues and problems using a comparative philosophy methodology and Asian perspectives, such as Indian, Chinese, and Japanese traditions.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring, Fall, Summer"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "103",
    "course_title": "Introduction to Philosophy: Environmental Philosophy",
    "course_desc": "This course offers a critical examination of the history of multi-cultural philosophical and ethical systems and their implications for interactions with, and relationships between, humans and non-humans. The critical examination will take place in the context of contemporary environmental/ecological issues.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "111",
    "course_title": "Introduction to Inductive Logic",
    "course_desc": "This course focuses on current society's use of probabilities and statistics, and explores how most academic disciplines use these types of data to analyze information and draw conclusions. Students will better understand and use probabilities, statistics, and risk evaluations to make better decisions, and more generally develop skills to safely draw inferences when available evidence leaves them unsure about what is true.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "204",
    "course_title": "Philosophy and Film",
    "course_desc": "In this course, students will watch a selection of movies and analyze them in light of the various philosophical ideas that they explore. Primary attention will be devoted to identifying, considering, and evaluating these philosophical ideas, the ways they are artistically presented in film, and their connections to both traditional philosophical problems and each student's personal world and life view.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "211",
    "course_title": "Ancient Philosophy",
    "course_desc": "This course explores a range of important ideas, arguments, and theories advanced by such ancient Greek philosophers as the Pre-Socratics, Socrates, Plato, Aristotle, the Hellenistic Stoics, Epicureans, and Skeptics. Using these thinkers, we will explore such timeless issues as what is the nature of reality and knowledge and what does it mean to be human, including what does it mean to be virtuous and good and what does it mean to love.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "213",
    "course_title": "Modern Philosophy",
    "course_desc": "In this course, students will be introduced to a range of important ideas, arguments, and theories advanced by such \"modern\" (17th-18th century) philosophers as Hobbes, Descartes, Spinoza, Leibniz, Locke, Berkeley, Hume, Kant, Nietzsche, etc. Primary attention will be devoted to the so-called \"rationalist\" and \"empiricist\" traditions and the way these modern philosophical traditions considered fundamental questions about the nature of reality, human beings and our knowledge of both. Immanuel Kant's important critique of these traditions and the way his ideas influenced the development of subsequent philosophy also will be considered.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "PHIL",
    "course_number": "225",
    "course_title": "Philosophy of Activism",
    "course_desc": "This course aims to improve understanding among students regarding basic rights and duties of citizens and the government including how to effect change. This will be addressed through the lens of philosophy. Students will engage in a philosophical analysis of law, rights, duties, citizenship, government, obligation, and social change.",
    "num_units": "3",
    "dept_name": "Philosophy (PHIL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (every even year); Prerequisites: \"C\" or higher in ENG 100."
  },
  {
    "course_prefix": "PHYL",
    "course_number": "141",
    "course_title": "Human Anatomy and Physiology I",
    "course_desc": "This course is a comprehensive introduction to the structure and function of the human body for students entering health or medically-related fields. This basic course includes a study of the body's embryology, gross anatomy, microanatomy, physiology, homeostatic relationships, and the use of anatomy and physiology terms and concepts to develop thinking, reading and writing skills, and problem-solving abilities. The integumentary, skeletal, muscular, and nervous systems are studied.",
    "num_units": "3",
    "dept_name": "Physiology (PHYL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in ENG 100. \"C\" or higher in both CHEM 151 and CHEM 151L or CHEM 161 and CHEM 161L.; Comments: Computer/internet access required."
  },
  {
    "course_prefix": "PHYL",
    "course_number": "142",
    "course_title": "Human Anatomy and Physiology II",
    "course_desc": "This course is the second half of a comprehensive introduction to the structure and function of the human body (endocrine, cardiovascular, lymphatic, respiratory, digestive, urinary, and reproductive systems), and use of anatomy and physiology terminology and concepts. This course will also develop thinking, reading and writing skills, and problem-solving abilities for students entering health or medically-related fields.",
    "num_units": "3",
    "dept_name": "Physiology (PHYL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in PHYL 141 and PHYL 141L.; Comments: Computer/internet access required."
  },
  {
    "course_prefix": "PHYS",
    "course_number": "101",
    "course_title": "Career and Technical Education Physics",
    "course_desc": "This course investigates the nature of science and selected topics among linear and rotational mechanics, problems of motion, energy, optics, pressure, fluids, wave motion, electricity, or magnetism. Basic trigonometry is introduced and used along with introductory algebra to solve problems. Emphasis is placed on practical applications of physics in industry and in everyday life. This course is geared for students pursuing certificates and applied science trade degrees.",
    "num_units": "3",
    "dept_name": "Physics (PHYS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 100."
  },
  {
    "course_prefix": "PHYS",
    "course_number": "151",
    "course_title": "College Physics I",
    "course_desc": "This course is the first half of a two-semester introduction to the fundamentals of physics and will cover kinematics, dynamics, energy, collisions and momentum, rotation, waves and sounds, as well as select topics on material properties and thermodynamics. Lectures and problem-solving will regularly use the mathematical tools of algebra, geometry, trigonometry, and vectors.",
    "num_units": "3",
    "dept_name": "Physics (PHYS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: Qualified for MATH 140X."
  },
  {
    "course_prefix": "PHYS",
    "course_number": "152",
    "course_title": "College Physics II",
    "course_desc": "This course is the second half of a two-semester introduction to the fundamentals of physics and will cover electromagnetism, the wave and particle nature of light, optics, nuclear physics, as well as selected topics from particle physics, string theory, quantum physics, relativity and condensed matter physics. Lectures and problem solving will regularly use the mathematical tools of algebra, geometry, trigonometry, and vectors.",
    "num_units": "3",
    "dept_name": "Physics (PHYS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher or concurrent enrollment in MATH 140X. \"C\" or higher in PHYS 151."
  },
  {
    "course_prefix": "PHYS",
    "course_number": "170",
    "course_title": "General Physics I",
    "course_desc": "This course is the first half of a two-semester introduction to the fundamentals of physics and will cover kinematics, dynamics, energy, collisions and momentum, rotation, waves and sounds, as well as select topics on material properties and thermodynamics. Lectures and problem-solving will regularly use the mathematical tools of algebra, geometry, trigonometry, vectors, and calculus.",
    "num_units": "4",
    "dept_name": "Physics (PHYS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall; Prerequisites: “C” or higher or concurrent enrollment in MATH 241."
  },
  {
    "course_prefix": "PHYS",
    "course_number": "175",
    "course_title": "Calculus-based Physics Supplement",
    "course_desc": "This course covers calculus topics, problem-solving rigor, and experimental focus needed to upgrade a previous introductory algebra-based physics lecture and lab (PHYS 151/151L) course to satisfy the requirements of an introductory calculus-based physics lecture and lab (PHYS 170/170L). Appropriate topics include meaning and applications of derivatives and integrals in solving equations, derivation of kinematic equations, estimation and meaning of areas under curves of various physical quantities, empirical modeling of accelerating objects, non-uniform rotational acceleration, impulse momentum theory, measuring hysteresis and loss of elastic energy, and simple harmonic motion as a differential equation.",
    "num_units": "1",
    "dept_name": "Physics (PHYS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher in PHYS 151 and PHYS 151L. \"C\" or higher or concurrent enrollment in MATH 241."
  },
  {
    "course_prefix": "PHYS",
    "course_number": "272",
    "course_title": "General Physics II",
    "course_desc": "This course is the second half of a two-semester introduction to the fundamentals of physics and will cover electromagnetism, the wave and particle nature of light, optics, nuclear physics, as well as selected topics from particle physics, string theory, quantum physics, relativity and condensed matter physics. Lectures and problem solving will regularly use the mathematical tools of algebra, geometry, trigonometry, vectors, and calculus.",
    "num_units": "3",
    "dept_name": "Physics (PHYS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher or concurrent enrollment in MATH 242. \"C\" or higher in PHYS 170 or PHYS 175."
  },
  {
    "course_prefix": "POLS",
    "course_number": "110",
    "course_title": "Introduction to Political Science",
    "course_desc": "This course is designed to introduce students to the fundamentals of political science, from the basic political concepts and theories to the scientific methods that are used within this field.",
    "num_units": "3",
    "dept_name": "Political Science (POLS)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall (every even year); Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "PSY",
    "course_number": "100",
    "course_title": "Survey of Psychology",
    "course_desc": "This course provides an overview of the field of psychology. Topics include: psychophysiology, perception, learning, cognition, stress, personality, social psychology, psychopathology and therapy styles.",
    "num_units": "3",
    "dept_name": "Psychology (PSY)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "PSY",
    "course_number": "240",
    "course_title": "Developmental Psychology",
    "course_desc": "This course offers principles of development from conception to death. The focus is on the interrelationship of physical, cognitive, and social-emotional aspects of the individual.",
    "num_units": "3",
    "dept_name": "Psychology (PSY)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in PSY 100."
  },
  {
    "course_prefix": "QM",
    "course_number": "108",
    "course_title": "Quantitative Methods for the Trades",
    "course_desc": "This course covers the quantitative methods, reasoning, and applications necessary to perform tasks and solve problems encountered by Trades students. Topics include computational operations; geometry and measurements; ratio, proportion, and percent; probability and statistics; and trigonometry.",
    "num_units": "3",
    "dept_name": "Quantitative Methods (QM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Comments: This course is for students currently enrolled in a Trades Technology program."
  },
  {
    "course_prefix": "REL",
    "course_number": "122",
    "course_title": "Greek and Roman Mythology",
    "course_desc": "In this course, students will be introduced to the primary narratives that the ancient Greeks and Romans told about their gods, their world and themselves. The emphasis throughout the course will be on reading, analyzing and evaluating classical Greek and Roman mythology.",
    "num_units": "3",
    "dept_name": "Religion (REL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "REL",
    "course_number": "150",
    "course_title": "Introduction to the World's Major Religions",
    "course_desc": "In this course, students will explore the history, literature, beliefs, and practices of the world's major religious traditions in an effort to understand how they shed light on the fabric of reality as well as the nature, meaning and struggles of human existence. Some of the religious traditions that will be considered include Hinduism, Buddhism, Judaism, Christianity, and Islam.",
    "num_units": "3",
    "dept_name": "Religion (REL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring, Summer"
  },
  {
    "course_prefix": "REL",
    "course_number": "205",
    "course_title": "Understanding Hawaiian Religion",
    "course_desc": "This course is an introductory survey of Hawaiian religious beliefs and practices from pre-contact to 1819.",
    "num_units": "3",
    "dept_name": "Religion (REL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "SCI",
    "course_number": "121",
    "course_title": "Introduction to Science (Biological Science)",
    "course_desc": "This general introduction to the basic concepts of biology is intended to provide the non-science majors with a basic understanding of their own bodies and the environment in which they live. This course is taught with a marine emphasis.",
    "num_units": "3",
    "dept_name": "Science (SCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "SCI",
    "course_number": "122",
    "course_title": "Introduction to Physical Science",
    "course_desc": "In this course, students will explore how relatively simple physical principles can explain and predict the outcome of natural events observed on Earth and beyond.",
    "num_units": "3",
    "dept_name": "Science (SCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100 and MATH 82X."
  },
  {
    "course_prefix": "SCI",
    "course_number": "125",
    "course_title": "Experimental Methods in Science",
    "course_desc": "SCI 125L explores experimental design, guiding principles, and limitations of good science. It emphasizes the analysis and credibility of scientific approaches and design and application of experimental methods to formulate hypotheses and test ideas.",
    "num_units": "1",
    "dept_name": "Science (SCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lab; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100 and MATH 100."
  },
  {
    "course_prefix": "SCI",
    "course_number": "170",
    "course_title": "STEMinar: Science, Technology, Engineering, and Mathematics Seminar",
    "course_desc": "This one-credit course primarily explores current topics in science, technology, engineering, and mathematics (STEM) in a seminar format. The course will also cover the process and guidelines of science, careers pathways in STEM, and the role of STEM in our modern economy and society.",
    "num_units": "1",
    "dept_name": "Science (SCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "SCI",
    "course_number": "199",
    "course_title": "Special Studies",
    "course_desc": "See explanation under the heading of Special Studies.",
    "num_units": "3",
    "dept_name": "Science (SCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: “C” or higher or concurrent enrollment in SCI 121.; Comments: May be repeated for a maximum of 6 credits."
  },
  {
    "course_prefix": "SCI",
    "course_number": "295",
    "course_title": "STEM Research Experience",
    "course_desc": "This course offers a research experience in science, technology, engineering, and/or mathematics, emphasizing the application of the scientific principles and methods to a specific project.",
    "num_units": "1",
    "dept_name": "Science (SCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lab; Semester Offered: Fall, Spring; Prerequisites: Approval of instructor.; Comments: May be repeated for a maximum of 6 credits."
  },
  {
    "course_prefix": "SOC",
    "course_number": "100",
    "course_title": "Survey of General Sociology",
    "course_desc": "In this course, we use sociological theory to analyze a broad range of topics, including the production of knowledge, culture and history, socialization, identity, social relationships, deviance and crime, social institutions, globalization, class and inequality, racism, sexism, and change. The goal of this course is to introduce students to sociological perspectives, concepts, and analytical tools that may be applied to the contemporary world.",
    "num_units": "3",
    "dept_name": "Sociology (SOC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "SOC",
    "course_number": "231",
    "course_title": "Introduction to Juvenile Delinquency",
    "course_desc": "This course focuses on juvenile delinquency in the U.S. and examines the nature of and trends in juvenile delinquency, explanations for and theories of juvenile delinquency, and institutional responses to and treatment of juvenile delinquency in the U.S. juvenile justice system.",
    "num_units": "3",
    "dept_name": "Sociology (SOC)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (every odd year)"
  },
  {
    "course_prefix": "SP",
    "course_number": "151",
    "course_title": "Personal and Public Speaking",
    "course_desc": "This course is an introduction to the fundamentals of speech communication in both traditional  face-to-face and synchronous or asynchronous online academic and professional settings. Students engage in activities to acquire competence in interpersonal, small group, and public speaking.",
    "num_units": "3",
    "dept_name": "Speech (SP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100S."
  },
  {
    "course_prefix": "SP",
    "course_number": "181",
    "course_title": "Interpersonal Communication",
    "course_desc": "This course explores through theory and practice the ways people communicate one-on-one and in informal situations. This course builds communication skills through experiential activities.",
    "num_units": "3",
    "dept_name": "Speech (SP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: Qualified for ENG 100."
  },
  {
    "course_prefix": "SP",
    "course_number": "185",
    "course_title": "Intercultural Communication",
    "course_desc": "This course analyzes human communication behaviors as well as verbal and nonverbal coding as it has been used and is currently used throughout the world. Students will examine how influences such as economics, science, politics, ecological concerns, social and family structures, and individual personalities affect communication transactions. Students will practice cross-cultural communication skills.",
    "num_units": "3",
    "dept_name": "Speech (SP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (every odd year); Prerequisites: Qualified for ENG 100S or “C” or higher in SP 151."
  },
  {
    "course_prefix": "SP",
    "course_number": "231",
    "course_title": "Performance of Literature",
    "course_desc": "This course introduces the student to the study of literature through performance. The student participates in individual and group presentations of poetry, prose, and drama. The process involved in preparation of a literary piece of performance leads to exploration and discoveries of multiple aesthetic dimensions of literature. Development of speech performance skills, written analysis of literature to be performed, and experience in critiquing presentations are areas stressed in the course.",
    "num_units": "3",
    "dept_name": "Speech (SP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring (every even year); Prerequisites: Qualified for ENG 100S or “C” or higher in either SP 151 or SP 251.; Comments: May be repeated for a maximum of 6 credits."
  },
  {
    "course_prefix": "SP",
    "course_number": "251",
    "course_title": "Principles of Effective Public Speaking",
    "course_desc": "This course provides extensive practice in preparing and presenting effective public speeches with special emphasis on organization, outlining, audience analysis, analytical reasoning, and delivery skills in both traditional face-to-face and synchronous or asynchronous online academic and professional settings.",
    "num_units": "3",
    "dept_name": "Speech (SP)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for ENG 100 or “C” or higher in SP 151."
  },
  {
    "course_prefix": "SPAN",
    "course_number": "101",
    "course_title": "Elementary Spanish I",
    "course_desc": "This course is an introduction to the Spanish language emphasizing conversation, listening, grammar, reading, and writing.",
    "num_units": "4",
    "dept_name": "Spanish (SPAN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Fall"
  },
  {
    "course_prefix": "SPAN",
    "course_number": "102",
    "course_title": "Elementary Spanish II",
    "course_desc": "This course is a continuation of SPAN 101 and covers conversation, listening, grammar, reading, and writing.",
    "num_units": "4",
    "dept_name": "Spanish (SPAN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in SPAN 101."
  },
  {
    "course_prefix": "SPAN",
    "course_number": "201",
    "course_title": "Intermediate Spanish I",
    "course_desc": "This course is a continuation of SPAN 102. Students will refine basic language skills through conversation, listening, and instruction in grammar, reading, and writing.",
    "num_units": "3",
    "dept_name": "Spanish (SPAN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Prerequisites: “C” or higher in SPAN 102."
  },
  {
    "course_prefix": "SPAN",
    "course_number": "202",
    "course_title": "Intermediate Spanish II",
    "course_desc": "This course is a continuation of SPAN 201 with an emphasis on conversation, listening, as well as instruction in grammar, reading, and writing.",
    "num_units": "3",
    "dept_name": "Spanish (SPAN)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring; Prerequisites: “C” or higher in SPAN 201."
  },
  {
    "course_prefix": "SSCI",
    "course_number": "113",
    "course_title": "Civic Leadership",
    "course_desc": "The purpose of this course is to help students build the leadership skills, knowledge, and habits necessary for civic engagement. To adequately prepare for a lifetime of civic engagement, students must grapple with foundational leadership questions relating to power, morality, and ethics. This course incorporates experiential/service learning, a proven civic education practice, that extends lessons beyond the classroom and into the community.",
    "num_units": "3",
    "dept_name": "Social Science (SSCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring"
  },
  {
    "course_prefix": "SSCI",
    "course_number": "250",
    "course_title": "Environmental Issues",
    "course_desc": "This course is an introduction to integrative social science that focuses on the topics of climate change, sustainability, and resilience. The course texts emphasize the interaction between individuals, social/cultural/economic/political systems, and the environment. Additionally, this course utilizes experiential learning to engage students with place-based, Native Hawaiian practices for caretaking the environment.",
    "num_units": "3",
    "dept_name": "Social Science (SSCI)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Spring (every odd year)"
  },
  {
    "course_prefix": "SSM",
    "course_number": "101",
    "course_title": "Introduction to the Science of Sustainability",
    "course_desc": "This course identifies sustainability concepts which have become evident from early human movement toward Industrialization in the 1500s to the present. Examines diverse societal circumstances and approaches in resource use including water, energy, waste, land use, economics, oceans, and others. Introduces fundamental systems approaches to recognize interconnections and ramifications of practices. Identifies global sustainability issues and uses Hawai‘i and island case studies as a means of better understanding their applied relevance.",
    "num_units": "3",
    "dept_name": "Sustainable Science Management (SSM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Concurrent enrollment in MATH 75X or qualified for MATH 82X."
  },
  {
    "course_prefix": "SSM",
    "course_number": "110",
    "course_title": "Sustainable Water and Waste Management",
    "course_desc": "This course explores water, wastewater, and waste management challenges and solutions, with an emphasis on issues specific to Hawai‘i. Students will explore sustainable operational management of water, wastewater, and solid waste systems. This includes composting, recycling processes, energy from waste, and water quality testing. Students will take water samples and analyze water quality with state-of-the-art technologies.",
    "num_units": "3",
    "dept_name": "Sustainable Science Management (SSM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: Qualified for MATH 100."
  },
  {
    "course_prefix": "SSM",
    "course_number": "275",
    "course_title": "Basic Energy Production",
    "course_desc": "This course will explore electricity generation, distribution, storage, and usage. We will take an in-depth look at the science, technology, and environmental considerations associated with electricity generation from coal, oil, natural gas, wind, solar, biomass, biogas, and hydroelectric (dam, tidal, wave). This class includes field trips to various electricity generation locations on island. We will also complete hands-on labs utilizing on campus renewable energy technologies.",
    "num_units": "3",
    "dept_name": "Sustainable Science Management (SSM)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher or concurrent enrollment in ENG 100. Qualified for MATH 82X or higher or approval of instructor."
  },
  {
    "course_prefix": "THEA",
    "course_number": "221",
    "course_title": "Beginning Acting 1",
    "course_desc": "This course is an introduction to acting. Students will practice a variety of individual and group exercises for developing stage performance techniques.",
    "num_units": "3",
    "dept_name": "Theatre (THEA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring"
  },
  {
    "course_prefix": "THEA",
    "course_number": "222",
    "course_title": "Beginning Acting II",
    "course_desc": "Students will conduct advanced work in improvisation and character development. Vocal and physical training is emphasized, particularly on scene work. Actors are expected to work together to present scenes to the class.",
    "num_units": "3",
    "dept_name": "Theatre (THEA)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall, Spring; Prerequisites: \"C\" or higher in THEA 221 or equivalent training from another institution with approval of instructor."
  },
  {
    "course_prefix": "WELD",
    "course_number": "117",
    "course_title": "Introduction to Welding",
    "course_desc": "This course is an introduction to Oxy/Acetylene and basic arc welding procedures in the workplace in accordance with American Welding Society (AWS) standards. Students will learn the proper safety techniques involved in handling welding equipment.",
    "num_units": "2",
    "dept_name": "Welding (WELD)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 4 lecture/lab; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in WELD 118."
  },
  {
    "course_prefix": "WELD",
    "course_number": "118",
    "course_title": "Shop Tools and Equipment",
    "course_desc": "This course will include instruction on basic hand tools. This course will also introduce proper handling of shop tools and equipment.",
    "num_units": "1",
    "dept_name": "Welding (WELD)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Fall; Prerequisites: \"C\" or higher or concurrent enrollment in WELD 117."
  },
  {
    "course_prefix": "WELD",
    "course_number": "120",
    "course_title": "Intermediate Welding I",
    "course_desc": "This course covers intermediate arc welding procedures, including the safe and proper use of shop equipment, tools, and materials. Students will learn weld symbols and structure. This course is also an introduction to Gas Metal Arc Welding (GMAW) or MIG welding.",
    "num_units": "2",
    "dept_name": "Welding (WELD)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 2 lecture/lab; Semester Offered: Spring; Prerequisites: “C” or higher in WELD 117 and WELD 118."
  },
  {
    "course_prefix": "WELD",
    "course_number": "141",
    "course_title": "Advanced Welding I",
    "course_desc": "This course covers introduction to safe practices, setup, and operation of Gas Tungsten Arc Welding (GTAW) equipment. Our students will use GTAW in steel and aluminum, sheet metal and mild steel plate in flat, butt, and tee positions. We will also cover out of position welding using GTAW or MIG in vertical and overhead positions. Emphasis will be on practice and production of assemblies and coupons to be examined and tested according to Section 8 AWS SENSE QC10.",
    "num_units": "3",
    "dept_name": "Welding (WELD)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture and 4 lecture/lab; Semester Offered: Spring; Prerequisites: \"C\" or higher or concurrent enrollment in WELD 120 and WELD 166.; Comments: May be repeated for a maximum of 6 credits."
  },
  {
    "course_prefix": "WELD",
    "course_number": "166",
    "course_title": "Plasma and Air Carbon Arc Cutting",
    "course_desc": "This course introduces plasma-arc cutting systems to students. These topics include safety, proper equipment setup, and operation of plasma and carbon air arc gouging equipment with emphasis on straight line, curve, and bevel cutting.",
    "num_units": "1",
    "dept_name": "Welding (WELD)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 1 lecture; Semester Offered: Spring; Prerequisites: \"C\" or higher in WELD 117 and WELD 118. \"C\" or higher or concurrent enrollment in WELD 120."
  },
  {
    "course_prefix": "ZOOL",
    "course_number": "105",
    "course_title": "Hawaiian Ethnozoology",
    "course_desc": "This course studies Hawaiian fishes, birds, and other creatures--their identification and habitat and their place in the heritage of the Hawaiian people, methods of capture, conservation techniques, and practical uses. Hawaiian and biological terminology will be used.",
    "num_units": "3",
    "dept_name": "Zoology (ZOOL)",
    "inst_ipeds": 141802,
    "metadata": "Class Hours: 3 lecture; Semester Offered: Fall; Comments: Cross-listed with HWST 213."
  }
]