[
  {
    "course_prefix": "Com",
    "course_number": "2158",
    "course_title": "Certified Cisco Networking Associate - CCNA2 v7 (Switching, Routing and Wireless Essentials) Online",
    "course_desc": "This course focuses on switching technologies and router operations that support small-to-medium business networks, including wireless local area networks (WLAN) and security concepts. In this second course in a 3-course CCNA series you’ll perform basic network configuration and troubleshooting, identify and mitigate LAN security threats, and configure and secure a basic WLAN. After completing all three CCNA courses, you are ready to take the CCNA Certification.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: This course focuses on switching technologies and router operations that support small-to-medium business networks, including wireless local area networks (WLAN) and security concepts. In this second course in a 3-course CCNA series you’ll perform basic network configuration and troubleshooting, identify and mitigate LAN security threats, and configure and secure a basic WLAN. After completing all three CCNA courses, you are ready to take the CCNA Certification.\n\nLearner Outcomes: At the end of the course, you will be able to:Work with routers, switches and wireless devices to configure and troubleshoot VLANs, Wireless LANs and Inter-VLAN routing.Configure and troubleshoot redundancy on a switched network using STP and EtherChannel.Develop critical thinking and problem-solving skills using real equipment and Cisco Packet Tracer.Explain how to support available and reliable networks using dynamic addressing and first-hop redundancy protocols.\n\nPrerequisites: 1. Completion of CCNA: Introduction to Networks or equivalent knowledge.2. Ability to build simple LANs, perform basic configurations for routers and switches, and implement IPv4 and IPv6 addressing schemes.3. Configure routers, switches, and end devices to provide access to local and remote network resources and to enable end-to-end connectivity between remote devices.4. Configure and troubleshoot connectivity on a small network using security best practices.5. Must have a computer/laptop with a camera and microphone and robust Internet.\n\nSection Notes: Expect 3 hours per day for independent study. Must be able to study independently and work collaboratively as part of a team, have a strong motivation to learn, and interest in a career in Information Technology.Equipment needs: Must have access to a computer/laptop with Windows as well as robust Internet access to complete assignments. A Chromebook is not adequate for this training.Skill requirements: Completion of CCNAv7: Introduction to Networks or equivalent knowledge and experience."
  },
  {
    "course_prefix": "Com",
    "course_number": "2159",
    "course_title": "CCNA 3: Enterprise Networking, Security, and Automation",
    "course_desc": "Large enterprises depend heavily on the smooth operation of their network infrastructures. This is why networking professionals are vital to every organization and those with networking skills can land a great job and set their sights on a rewarding career! This third course in the 3-course CCNA series describes the architectures and considerations related to designing, securing, operating, and troubleshooting enterprise networks. It covers wide area network (WAN) technologies and quality of service (QoS) mechanisms used for secure remote access along with the introduction of software-defined networking, virtualization, and automation concepts that support the digitalization of networks.\nThis course prepares participants for networking analyst and engineering positions. Tuition covers a certification exam voucher for the CCNA certification.\nRequired prep: Completion of CCNA 1 v7 (Introduction to Networks) and CCNA 2 v7 (Switching, Routing and Wireless Essentials) or equivalent knowledge and experience",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: This third course in the 3-course CCNA series describes the architectures and considerations related to designing, securing, operating, and troubleshooting enterprise networks. It covers wide area network (WAN) technologies and quality of service (QoS) mechanisms used for secure remote access along with the introduction of software-defined networking, virtualization, and automation concepts that support the digitalization of networks.\n\nLearner Outcomes: At the end of the course, you will be able to:Work with routers, switches and wireless devices to configure and troubleshoot VLANs, Wireless LANs and Inter-VLAN routing.Configure and troubleshoot redundancy on a switched network using STP and EtherChannel.Develop critical thinking and problem-solving skills using real equipment and Cisco Packet Tracer.Explain how to support available and reliable networks using dynamic addressing and first-hop redundancy protocols.\n\nPrerequisites: 1. Completion of CCNA 1 v7 (Introduction to Networks) and CCNA 2 v7 (Switching, Routing and Wireless Essentials) or equivalent knowledge and experience.2. Experience and/or knowledge working with routers, switches and wireless devices to configure and troubleshoot VLANs, Wireless LANs and Inter-VLAN routing.3. Ability to configure and troubleshoot redundancy on a switched network using STP and EtherChannel.4. Ability to explain how to support available and reliable networks using dynamic addressing and first-hop redundancy protocols.5. Must have a computer/laptop with a camera and microphone and robust Internet.\n\nSection Notes: Expect 3 hours per day for independent study. This final course prepares candidates for the 200-301 CCNA certification exam. Participants are expected to take the certification exam.Equipment needs: Must have access to a computer/laptop with Windows as well as robust Internet access to complete assignments. A Chromebook is not adequate for this training.Skill requirements: Completion of CCNAv7: Introduction to Networks and CCNA 2 v7 (Switching, Routing and Wireless Essentials) or equivalent knowledge and experience"
  },
  {
    "course_prefix": "Com",
    "course_number": "2162",
    "course_title": "AWS Solutions Architect - Associate",
    "course_desc": "This intermediate-level course covers the fundamentals of building IT infrastructure on AWS and helps participants gain the skills they need to pursue the AWS Certified Solutions Architect – Associate certification. This course contains approximately 40 hours of content delivered through lectures, hands-on labs, and project work. \nThe abilities validated by the AWS Solutions Architect - Associate certification are covered in this training:\nEffectively demonstrate knowledge of how to architect and deploy secure and robust applications on AWS technologies\nDefine a solution using architectural design principles based on customer requirements\nProvide implementation guidance based on best practices to the organization throughout the life cycle of the project\nThe AWS Certified Solutions Architect - Associate examination is intended for individuals who perform a solutions architect role and have one or more years of hands-on experience designing available, cost-efficient, fault-tolerant, and scalable distributed systems on AWS.\nHonolulu Community College is an AWS Academic Academy using curriculum and resources developed by AWS. Materials are continually updated by AWS for optimal  learning.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": ""
  },
  {
    "course_prefix": "Com",
    "course_number": "2163",
    "course_title": "AWS Cloud Foundations",
    "course_desc": "This course provides an overall understanding of the Amazon Web Services (AWS) Cloud, independent of specific technical roles. You will learn about AWS cloud concepts, AWS core services, security, architecture, pricing, and support to build your AWS Cloud knowledge. It contains 20 hours of course content and prepares participants to pursue an AWS Certified Cloud Practitioner certification.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": ""
  },
  {
    "course_prefix": "Com",
    "course_number": "2184",
    "course_title": "Tech+ Certification Training and Exam Prep",
    "course_desc": "CompTIA Tech+ is the essential certification that equips you with the foundational knowledge needed to thrive in today's digital world. With a comprehensive curriculum covering everything from basic concepts and security to software development, CompTIA Tech+ provides a well-rounded education that's easy to apply in any learning environment. Whether you're a student, a career changer, or a lifelong learner, CompTIA Tech+ can help you gain the skills and confidence to succeed in the tech industry. Through hands-on simulations and exposure to emerging technologies like AI and robotics, you'll acquire the practical knowledge and expertise necessary to stand out in the competitive tech job market. The CompTIA Tech+ certification is considered good for life and does not need to be renewed.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": ""
  },
  {
    "course_prefix": "Com",
    "course_number": "2164",
    "course_title": "A+ Computer Training and Certification Prep",
    "course_desc": "A+ is a good starting point for entering a career in Information Technology as it provides foundational skills and knowledge.\nTopics covered include:\nHardware - Identifying, using, and connecting hardware components and devices\nOperating Systems - Installing and supporting Windows OS including command line and client support. Understanding Mac OS, Linux, and mobile OS\nSoftware Troubleshooting - Troubleshooting PC and mobile device issues including application security support\nNetworking - Explaining types of networks and connections including TCP/IP, WiFi, and SOHO\nHardware and Network Troubleshooting - Troubleshooting device and network issues\nSecurity - Identifying and protecting against security vulnerabilities for devices and their network connections\nMobile Devices - Installing and configuring laptops and other mobile devices\nVirtualization and Cloud Computing - Comparing and contrasting cloud computing concepts and set up client-side virtualization\nOperational Procedures - Following best practices for safety, environmental impacts, and communication and professionalism\nJobs that use knowledge gained in an A+ course include Help Desk Technician, Technical Support Specialist, Service Desk Analyst, Data Support Technician, and others. It is recommended that you consider continued learning in related areas such as Networking and Security.\nTraining is distance-delivered via Zoom with a combination of live lectures, readings, and labs. Many hours of independent self-study are expected outside of class meetings.\nThis course prepares you for the two parts of the CompTIA A+ certification. Although test prep for the certification exams is covered in class, additional study is needed. Certification exams which are included in this training are scheduled at the end of the course. Participants must report their test dates and exam results.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: A+ is a good starting point for entering a career in Information Technology as it provides foundational skills and knowledge. Topics include, hardware, operating systems, software troubleshooting, networking, security, mobile devices, virtualization and Cloud computing, and operational procedures. This course prepares you for the two parts of the CompTIA A+ certification. Although test prep for the certification exams is covered in class, additional study is needed.\n\nLearner Outcomes: - Hardware - Identifying, using, and connecting hardware components and devices- Operating Systems - Installing and supporting Windows OS including command line and client support. Understanding Mac OS, Linux, and mobile OS- Software Troubleshooting - Troubleshooting PC and mobile device issues including application security support- Networking - Explaining types of networks and connections including TCP/IP, WiFi, and SOHO- Hardware and Network Troubleshooting - Troubleshooting device and network issues- Security - Identifying and protecting against security vulnerabilities for devices and their network connections- Mobile Devices - Installing and configuring laptops and other mobile devices- Virtualization and Cloud Computing - Comparing and contrasting cloud computing concepts and set up client-side virtualization- Operational Procedures - Following best practices for safety, environmental impacts, and communication and professionalism\n\nPrerequisites: 1. Must be a strong computer user and be familiar with IT terminology. Helpful to have some experience with hardware and operating systems.2. Completion of IT Fundamentals or equivalent knowledge is required.3. Must have a computer/laptop with a camera and microphone and robust Internet.\n\nSection Notes: Expect 3 hours per day self-study including weekends.Additional Skills: Ability to study independently and work collaboratively as part of a team, strong motivation to learn, interest in Information Technology, time to participate in an internship or apprenticeship."
  },
  {
    "course_prefix": "Com",
    "course_number": "2124",
    "course_title": "Network+ Training and Certification Prep",
    "course_desc": "Network+ prepares you for a career in IT infrastructure. Knowing how to install, configure, operate, manage, maintain, and troubleshoot a computer network is a highly marketable and exciting skill.\nTopics covered include:\nNetworking Concepts - Explain the purpose of a variety of networking concepts and implement them appropriately\nInfrastructure - Determine and explain appropriate cabling, device, and storage technologies\nNetwork Operations - Use best practices to manage the network, determine policies, and ensure business continuity\nNetwork Security - Summarize physical security and common attacks while securing the wired and wireless network\nNetwork Troubleshooting and Tools - Explain the network troubleshooting methodology and appropriate tools to support connectivity and performance\nAfter completing this course and the accompanying hands-on lab exercises, you will be prepared to select the best network design, hardware, and software for your environment. You will also have the skills to build a network from scratch and maintain, upgrade, troubleshoot, and manage an existing network.\nTraining is distance-delivered via Zoom with a combination of live lectures, readings, and labs. Many hours of independent self-study are expected outside of class meetings.\nThis course prepares you for the CompTIA Network+ certification. Although test prep for the certification exams is covered in class, additional study is needed. Certification exam which is included in this training is scheduled at the end of the course. Participants must report their test date and exam results.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: Network+ prepares you for a career in IT infrastructure. Knowing how to install, configure, operate, manage, maintain, and troubleshoot a computer network is a highly marketable and exciting skill. This course prepares you for the CompTIA Network+ certification. Although test prep for the certification exams is covered in class, additional study is needed.\n\nLearner Outcomes: Networking Concepts - Explain the purpose of a variety of networking concepts and implement them appropriatelyInfrastructure - Determine and explain appropriate cabling, device, and storage technologiesNetwork Operations - Use best practices to manage the network,determine policies, and ensure business continuityNetwork Security - Summarize physical security and common attacks while securing the wired and wireless networkNetwork Troubleshooting and Tools - Explain the network troubleshooting methodology and appropriate tools to support connectivity and performance\n\nPrerequisites: 1. Evidence of A+ certification or equivalent knowledge is required.2. Network-related IT experience is helpful but not necessary.3. Must have a computer/laptop with a camera and microphone and robust Internet to complete assignments.\n\nSection Notes: "
  },
  {
    "course_prefix": "Com",
    "course_number": "2036",
    "course_title": "Security+ Training and Certification Prep",
    "course_desc": "Security+ is a great course for people who want to begin their cybersecurity career. It establishes the core knowledge required of any cybersecurity role and provides a springboard to intermediate-level cybersecurity jobs. Security+ incorporates best practices in hands-on trouble-shooting to ensure security professionals have practical security problem-solving skills. Cybersecurity professionals with Security+ know how to address security incidents - not just identify them.\nThis Security+ course is taught with a practical approach to prepare you for the certification exam and for skills required on the job. You will apply general security concepts to real world scenarios. Competencies match the CompTIA certification exam areas. Topics covered include:\nThreats, Attacks, and Vulnerabilities - Detect various types of compromise and have an understanding of penetration testing and vulnerability scanning concepts\nTechnologies and Tools - Install, configure, and deploy network components while assessing and troubleshooting issues to support organizational security\nArchitecture and Design - Implement secure network architecture concepts and systems design\nIdentity and Access Management - Install and configure identity and access services, as well as management controls\nRisk Management - Implement and summarize risk management best practices and the business impact\nCryptography and PKI - Understanding of basic cryptographic concepts, algorithms, and functions. Install and configure wireless security settings and implement public key infrastructure.\nTraining is distance-delivered via Zoom with a combination of live lectures, readings, and labs. Many hours of independent self-study are expected outside of class meetings.\nThis course prepares you for the CompTIA Security+ certification. Although test prep for the certification exams is covered in class, additional study is needed. Certification exam which is included in this training is scheduled at the end of the course. Participants must report their test date and exam results.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: Security+ establishes the core knowledge required of any cybersecurity role. You will learn best practices in hands-on trouble-shooting to develop practical security problem-solving skills. Required preparation: Completion of A+ and Network+ training and certification or equivalent knowledge and experience is required. Two years of IT administration experience in a professional environment with emphasis on security and Network+ or equivalent knowledge is very helpful.\n\nLearner Outcomes: Threats, Attacks, and Vulnerabilities - Detect various types of compromise and have an understanding of penetration testing and vulnerability scanning conceptsTechnologies and Tools - Install, configure, and deploy network components while assessing and troubleshooting issues to support organizational securityArchitecture and Design - Implement secure network architecture concepts and systems designIdentity and Access Management - Install and configure identity and access services, as well as management controlsRisk Management - Implement and summarize risk management best practices and the business impactCryptography and PKI - Understanding of basic cryptographic concepts, algorithms, and functions. Install and configure wireless security settings and implement public key infrastructure\n\nPrerequisites: 1. Completion of A+ and Network+ training and certification or equivalent knowledge and experience is required.2. Two years of IT administration experience in a professional environment with emphasis on security is very helpful.3. Must have a computer/laptop with a camera and microphone and robust Internet to complete assignments.\n\nSection Notes: No Meeting: September 1st"
  },
  {
    "course_prefix": "Com",
    "course_number": "2178",
    "course_title": "CASP+ Training and Certification Prep",
    "course_desc": "CASP+ Training and Certification Prep CompTIA Advanced Security Practitioner (CASP)+ is an advanced level cyber security certification for security architects and senior security engineers charged with leading and improving an enterprise’s cybersecurity readiness. They are able to work in traditional, cloud, and hybrid environments, have governance, risk, and compliance skills, are expected to assess an enterprise’s cybersecurity readiness, and lead technical teams to implement enterprise-wide cybersecurity solutions.\nCourse topics include:\nSecurity architecture\nSecurity operations\nGovernance, risk, and compliance\nSecurity engineering and cryptography\nCASP+ is compliant with ISO 17024 standards and approved by the US DoD to meet directive 8140/8570.01-M requirements. Regulators and governments rely on ANSI accreditation, because it provides confidence and trust in the outputs of an accredited program.\nA certification voucher is included with the course and it is a requirement to take the certification exam if you are using grant funds to pay for your training. This is a performance-based certification for advanced practitioners – not managers – at the advanced skill level of cybersecurity. While managers help identify the cybersecurity policies and frameworks which could be implemented, CASP+ certified professionals determine and implement appropriate solutions.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": ""
  },
  {
    "course_prefix": "Com",
    "course_number": "2179",
    "course_title": "CySA+ Training and Certification Prep",
    "course_desc": "This is an intermediate level security course which covers both current and upcoming job skills used by threat intelligence analysts, application security analysts, compliance analysts, incident responders and handlers, and threat hunters. It provides new techniques for combating threats in and outside the Security Operations Center (SOC). Course topics include:\nSecurity operations and monitoring\nSoftware and systems security\nIncident response\nAutomation\nThreat and vulnerability management\nIT regulatory compliance and assessment\nCompTIA CySA+ meets the ISO 17024 standard and is approved by U.S. Department of Defense (DoD) to fulfill Directive 8570.01-M requirements. It also meets the KSAT requirements of various DoD Cyberspace Workforce (DCWF) work roles identified in Directive 8140, as mapped by the U.S. Institute of Defense Analysis (IDA). It is compliant with government regulations under the Federal Information Security Management Act (FISMA).\nAll course materials are provided. A certification exam voucher is included with the course",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: This is an intermediate level security course which covers both current and upcoming job skills used by threat intelligence analysts, application security analysts, compliance analysts, incident responders and handlers, and threat hunters. It provides new techniques for combating threats in and outside the Security Operations Center (SOC).\n\nLearner Outcomes: Completion of training and passing the CySA+ certification will verify the participant has the knowledge and skills required to:Leverage intelligence and threat detection techniquesAnalyze and interpret dataIdentify and address vulnerabilitiesSuggest preventative measuresEffectively respond to and recover from incidents\n\nPrerequisites: 1. Completion of Network+ and Security+ or equivalent knowledge and/or experience.2. 3 to 5 years of hands-on information security or related experience is highly recommended.\n\nSection Notes: Required preparation: Competition of Network+ and Security+ or equivalent knowledge and/or experience. Four years of hands-on information security or related experience is highly recommended."
  },
  {
    "course_prefix": "Com",
    "course_number": "2144",
    "course_title": "Intro to UX/UI Design, ADA Essentials w/AI Copilot",
    "course_desc": "In this course, students learn the fundamentals of designing user-friendly websites while ensuring accessibility for all users. The course covers the basics of UX/UI design and principles of ADA compliance. Students will apply their knowledge of UX/UI fundamentals and ADA compliance principles through hands-on exercises and projects. This practical experience will equip them with the skills needed to tackle real-world design challenges. By the end of this course, students will be equipped with the knowledge and skills necessary to pursue further education or professional opportunities in these domains.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: This course teaches you the basics of creating websites that are:User-friendly (Fun and easy for anyone to navigate)Accessible (Usable by people with disabilities).By the end of this course, you'll have the skills to:Build websites people love to use.Pursue a career in web design.\n\nLearner Outcomes: Understanding the user experience (UX) and user interface (UI) design principles, including principles of layout, typography, color theory, visual hierarchy, and usability.Effectively organizing information and creating interactive elements and animations to support messaging goals, optimize user navigation, and enhance engagement.Understanding and implementing ADA compliance principles in website design and content creation.Developing wireframes and prototypes to visualize and test website functionality.Implementing accessibility features following WCAG and WAI-ARIA guidelines for inclusive accessible website design.Designing responsive and mobile-friendly interfaces for diverse devices.\n\nPrerequisites: Tech Requirements:Computer: Reliable with high-speed internet.Camera & Microphone: For online class through ZoomSoftware Savvy: Downloading, installing, and web browsing with different browsers.Zoom Ready: Camera always on.\n\nSection Notes: "
  },
  {
    "course_prefix": "Com",
    "course_number": "2185",
    "course_title": "Intermediate UX/UI Design with ADA Compliance",
    "course_desc": "Elevate your design skills in this comprehensive intermediate course focused on UX/UI principles with a strong emphasis on ADA compliance. Over the scheduled weeks, you'll explore essential design techniques, advanced research methods, and the importance of accessibility in creating user-centered experiences. Dive deep into wireframing, prototyping, and visual design while learning to implement best practices that adhere to the Americans with Disabilities Act and Web Content Accessibility Guidelines. Through hands-on projects, usability testing, and group discussions, you’ll develop a robust portfolio piece that showcases your ability to design inclusive, accessible digital products. Join us to create engaging interfaces that cater to all users, ensuring that your designs are not only beautiful but also functional and compliant.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: \n\nLearner Outcomes: \n\nPrerequisites: Must complete Introduction to UX/UI or equivalent based onthe basics of UX/UI design and principles of ADA compliance.Tech Requirements:Computer: Reliable with high-speed internet.Camera & Microphone: For online class through ZoomSoftware Savvy: Downloading, installing, and web browsing with different browsers.Zoom Ready: Camera always on.\n\nSection Notes: No meeting: January 19, 2026 and February 23, 2026"
  },
  {
    "course_prefix": "Com",
    "course_number": "2173",
    "course_title": "Website Design & Development: Creating E-Commerce Sites",
    "course_desc": "In this project-based, hands-on course, you will learn to create a basic e-commerce website. Topics include the home page, product and about pages, shopping cart, contact, and privacy policy pages.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": ""
  },
  {
    "course_prefix": "Com",
    "course_number": "2135",
    "course_title": "Programming Essentials in Python (PCEP)",
    "course_desc": "This course introduces universal computer programming concepts such as data types, containers, functions, conditions, loops, as well as Python programming language syntax, semantics, and the runtime environment. Upon course completion with additional self-study, participants will be prepared to take the PCEP - Certified Entry-Level Python Programmer certification.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: This course introduces universal computer programming concepts such as data types, containers, functions, conditions, loops, as well as Python programming language syntax, semantics, and the runtime environment. Upon course completion with additional self-study, participants will be prepared to take the PCEP - Certified Entry-Level Python Programmer certification.\n\nLearner Outcomes: \n\nPrerequisites: 1. Must be an experienced computer user.2. Previous knowledge of programming languages is helpful, but not required.3. Must have access to a computer/laptop with camera and microphone with robust Internet to access course materials and labs.\n\nSection Notes: PCEP certification exam is included with training. Expect 5 weekly self-study hours.Certification exam is included with this course.No meetings on November 11, 2025 and November27, 2025"
  },
  {
    "course_prefix": "Com",
    "course_number": "2175",
    "course_title": "Programming Essentials in Python (PCAP)",
    "course_desc": "The Python PCAP course continues where Python PCEP ended. This hands-on course offers skills-based experience and prepares you for the PCAP - Certified Associate in Python programming certification. Skills covered in this course will be focused on object-oriented programming techniques such as creating modules and packages, working with file inputs and outputs, importing external packages and sharing packages. Training opens a path to the developer’s career.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": "Course Outline: The Python PCAP course continues where Python PCEP ended. This hands-on course offers skills-based experience and prepares you for the PCAP - Certified Associate in Python programming certification. Skills covered in this course will be focused on object-oriented programming techniques such as creating modules and packages, working with file inputs and outputs, importing external packages and sharing packages. Training opens a path to the developer’s career.\n\nLearner Outcomes: \n\nPrerequisites: 1. Completion of Python PCEP course or PCEP certification or equivalent knowledge and experience.2. Must have a computer/laptop with a camera and microphone and robust Internet.\n\nSection Notes: Certification exam is included with this course.No meeting on March 26, 2026"
  },
  {
    "course_prefix": "Com",
    "course_number": "2187",
    "course_title": "Introduction to AI for Workforce Development",
    "course_desc": "Dive into the world of artificial intelligence with our hands-on introductory course! This six-week training provides a comprehensive introduction to and exploration of AI fundamentals and their transformative role in workforce development. Using materials from the Intel AI for Workforce program and the Orange data mining software, you'll not only gain a solid grasp of AI concepts but also hands-on experience with the following:\n\nAI Fundamentals: Start with the basics of Artificial Intelligence, diving into its core principles and real-world applications.\nAI vs. Generative AI vs. Chatbots: Uncover the distinctions between these exciting technologies and their unique uses.\nPractical Use Cases: Discover how AI is revolutionizing workforce sectors such as healthcare, finance, and more.\nOpen-Source Tools: Evaluate and compare tools like ChatGPT and Advanced Gemini, and learn how they enhance professional tasks.\nMathematical Computing: Get comfortable with SciPy and NumPy for data analysis and AI modeling.\nNatural Language Processing (NLP): Understand the generation of NLP and its practical applications.\nEngage in practical projects, like building chatbots, without needing any prior programming experience. This course emphasizes learning by doing, incorporating no-code tools and introductory Python coding to empower you to create your own AI applications.",
    "dept_name": "Pacific Center for Advanced Technology Training",
    "inst_ipeds": 383190,
    "metadata": ""
  }
]